[{"course_num":"229","department":"Music","approval_date":"3/12/09","description":"3 hrs., 2 crs. Prerequisite: Open only to students enrolled in the Aaron Copland School of Music.","text":"AIV. 1 Aaron Copland School of Music (08-29, approved by Academic Senate 3/12/09)\nMusic 229 .  Introduction to the Alexander Technique.\n3 hrs., 2 crs. Prerequisite: Open only to students enrolled in the Aaron Copland School of Music.\nThe principles and concepts of the Alexander Technique and their relation to playing an instrument and to singing.  Students will learn how to reduce and prevent neck, back and shoulder pain, tendonitis and repetitive strain injuries which are all common injuries for musicians.  Students will also become aware of physical habits of misuse and anxiety that impede performance and will be shown how to transform those habits into improved breathing, moving with greater ease, and allowing for fuller emotional availability and expression.\nJustification:\n“The New Handbook in Music Education Research” has begun to address the issues by identifying the problems and looking to music education and educators as needing to take some responsibility.  The New Handbook describes the Alexander technique as a possible nontraditional, non-surgical treatment approach for ailing performing artists.   The Alexander technique is discussed again in reference to the prevention of musician’s medical problems and the physician authors state; “The fact is that most musicians seem to agree that with “proper teaching,” whatever that may be, many problems would not arise later in their musical life.”\nSeveral recent studies with the Alexander technique and music students playing scales have been performed with the use of Magnetic Resonance Imaging systems (MRI and FMRI).  Key velocity and timing data was collected and showed that evenness of touch (key velocity) improved significantly after Alexander technique lessons.  These studies appear to demonstrate that the Alexander technique is not only effective in treating ailing musicians as an injury- preventative technique, but also as a way to improve instrument pedagogy and playing technique.\nThe rationale supporting this initiative is that the adoption of a class based on the Alexander technique principles will encourage healthy playing and performance habits and better amalgamate the intellectual elements with the psycho-physical elements of playing an instrument and singing.","justification":"Instrument and performance related injury is a major problem with performing musicians and even more so for college and conservatory student musicians.  Some of the most striking findings have recently emerged in a study from the British Association of performing arts medicine (BAPAM).  Just over 48% of the 1046 musicians seen at BAPAM since 1992 had a ‘clear-cut’ pathology, in which a specific medical diagnosis could be made. Even more alarming is that this figure rose to 70% among students.","id":"1","title":"Introduction to the Alexander Technique","disp":"Aaron Copland School of Music"},{"course_num":"398","hours":"140","department":"ACCT","credits":"3","description":"Open only to Accounting majors who are at least lower seniors with a major GPA of at least 3.0.","prereq":"Permission of chair","text":"AIV. 2  Internship in Accounting\nACCT 398. Internship.\n140 hr.; 3 cr. Prereq: Permission of chair. Open only to Accounting majors who are at least lower seniors with a major GPA of at least 3.0.\nPrereq: Permission of chair. Open only to Accounting majors who are at least lower seniors with a major GPA of at least 3.0.\nOpen only to Accounting majors who are at least lower seniors with a major GPA of at least 3.0.\nUnder the supervision of a full-time faculty member in Accounting, students will complete at least 140 hours of work at an approved accounting firm.  Students will keep a daily log of activities, read two books approved by the faculty mentor, preparing book summaries of 5 – 8 pages each, and will meet bi-weekly with the faculty mentor to assess progress. Students will write a final research paper of at least 20 pages on a topic relevant to the nature and scope of the internship, and which has been approved by the faculty mentor. The internship may be used as one of the “Group A” electives required for the major in Accounting and Information Systems.\nJustification: Within the last several years, there has been a growing demand on the part of accounting students for internships for credit.  Currently, the only source for internship positions for our students is through the Office of Career Development and Internships. By offering internships for credit, the Department of Accounting can offer another route for those students who want a taste of the working world as part of their studies.\nThe Department of Accounting is using as its model other Departments who currently offer internships for credit.  As examples, Political Science, Media Studies, and Computer Science have been offering credit bearing internships with great success. By joining the ranks of these and other Departments, we will be able to enlighten accounting firms as to the quality of students that study in our Program.\nBy offering credit bearing internships, students’ academic performance is likely to increase. There is a nexus between what is learned via an internship and what is learned in the classroom. The credit bearing internship requires book reviews, logs, and a final paper.\nBy allowing our students to get a taste of  the world of work before they graduate, their chances of career success will be optimized after they graduate. For those students that are vacillating between accounting and a different major, the credit bearing internship would help to crystallize their decision.\nIn the current economy, costs are being cut by all sectors at all levels. By providing pre-screened, quality candidates for credit bearing internships, accounting firms can reap the benefits of our students’ work efforts and talents.\nIn summation, the Department of Accounting maintains that by establishing credit bearing internships, a very attractive scenario will be created for all parties involved.","justification":"Within the last several years, there has been a growing demand on the part of accounting students for internships for credit.  Currently, the only source for internship positions for our students is through the Office of Career Development and Internships. By offering internships for credit, the Department of Accounting can offer another route for those students who want a taste of the working world as part of their studies.","title":"Internship"},{"course_num":"161","hours":"3","department":"ENGL","credits":"3","text":"AIV. 3 PLAS\nENGL 161, 161W. Introduction to Narrative\n3 hr., 3 cr. Prereq: ENGL 110\nPrereq: ENGL 110\nWhy do human beings produce and consume narratives as prolifically as they do? How are stories constructed? How do readers approach and consume them? What is the role of narrative in culture? This course primarily studies prose fiction, but it may include drama, narrative poetry, nonfiction, and film, as well as criticism and theory of narrative. It may be offered as a general introduction to narrative, or it may focus on a particular topic, such as Life Writing, Popular Literature, Myths and Folktales, or the Contemporary Novel. (RL)","title":"161W","description":"Why do human beings produce and consume narratives as prolifically as they do? How are stories constructed? How do readers approach and consume them? What is the role of narrative in culture? This course primarily studies prose fiction, but it may include drama, narrative poetry, nonfiction, and film, as well as criticism and theory of narrative. It may be offered as a general introduction to narrative, or it may focus on a particular topic, such as Life Writing, Popular Literature, Myths and Folktales, or the Contemporary Novel. (RL)"},{"course_num":"","department":"Use of literature to deepen the understanding of the rich, complex","hours":"3","credits":"3","text":"AIV. 4 PLAS\nENGL 162W Literature and Place\n3  hr 3 cr Prereq: ENGL 110\nPrereq: ENGL 110\nUse of literature to deepen the understanding of the rich, complex, and varied engagement between human beings and the places they inhabit and imagine. Examination of how places, with their history, traditions, myths, customs, tensions, social structures, and physical form, interact with people’s lives. Specific sections will focus on a particular city, neighborhood, or region or on a topic such as City and Country, Women and the Black Diaspora, Utopia, the Literature of the Sea, Elizabethan London, the American West, Colonies, Imaginary Places, Homelessness, or Outer Space. Readings may include fiction, drama, poetry, life writing, and nonfiction. (RL)","title":"and varied engagement between human beings and the places they inhabit and imagine","description":"ENGL 162W Literature and Place"},{"course_num":"220","hours":"3","department":"ARTH","credits":"3","text":"AIV. 5 PLAS\nARTH 220, Renaissance Art and the Birth of Modernity\n3 hr. 3 cr.; Prereq: none (ARTH 1, 101, or 102 recommended as preparation)\nPrereq: none (ARTH 1, 101, or 102 recommended as preparation)\nThe profound innovations in painting, sculpture, and architecture created in Europe from about 1300 to 1700, which set the course and standards for much of western visual culture down to the past century. We will examine what is meant by the term “Renaissance” in the visual arts and European society at large, including its contacts and exchanges with global cultures outside the west, the tension between the new secular spirit and the ongoing influence of faith and the church, artistic developments that were influenced by increasing contacts with Africa, Asia, and the Islamic lands, and how Europeans interacted with cultures around the world as they explored and colonized the globe, particularly Latin America. (AP, ET, PI)","title":"Renaissance Art and the Birth of Modernity","description":"The profound innovations in painting, sculpture, and architecture created in Europe from about 1300 to 1700, which set the course and standards for much of western visual culture down to the past century. We will examine what is meant by the term “Renaissance” in the visual arts and European society at large, including its contacts and exchanges with global cultures outside the west, the tension between the new secular spirit and the ongoing influence of faith and the church, artistic developments that were influenced by increasing contacts with Africa, Asia, and the Islamic lands, and how Europeans interacted with cultures around the world as they explored and colonized the globe, particularly Latin America. (AP, ET, PI)"},{"course_num":"233","hours":"3","department":"ARTH","credits":"3","text":"AIV. 6 PLAS\nARTH 233, Naturalism and Art in Seventeenth-century Europe\n3 hr., 3 cr.; Prereq: none (ARTH 001, 101, or 102 recommended as preparation)\nPrereq: none (ARTH 001, 101, or 102 recommended as preparation)\nExamination of the paintings, prints, and drawings on new, secular subjects created in the seventeenth century in modern-day Belgium and the Netherlands. We will devote attention to naturalism as a style and as an aesthetic, and interrogate its role in the critical debates over the meaning of these images. We will explore why an aesthetic rooted in everyday reality was consciously cultivated, and how cultural factors such as a newly proclaimed national independence, increasing secularization, the growing role of observation in the sciences, and a capitalist economy engaged in global trade shaped the new art of the period. (AP, ET)","title":"Naturalism and Art in Seventeenth","description":"Examination of the paintings, prints, and drawings on new, secular subjects created in the seventeenth century in modern-day Belgium and the Netherlands. We will devote attention to naturalism as a style and as an aesthetic, and interrogate its role in the critical debates over the meaning of these images. We will explore why an aesthetic rooted in everyday reality was consciously cultivated, and how cultural factors such as a newly proclaimed national independence, increasing secularization, the growing role of observation in the sciences, and a capitalist economy engaged in global trade shaped the new art of the period. (AP, ET)"},{"course_num":"256","hours":"3","department":"ARTH","credits":"3","text":"AIV. 7 PLAS\nARTH 256. Contemporary Art Practices\n3 hr., 3 cr.; Prereq: none (ARTH 001 or 102 recommended as preparation)\nPrereq: none (ARTH 001 or 102 recommended as preparation)\nIntroduction to the range of contemporary art modalities in light of the socio-political context in which they arose or flourished, with a view to illuminating the ideas and ambitions embedded within this challenging, anti-traditional work. The course will address both the practices of the visual arts (style, genre, media, movements), and the multiple theoretical bases for justifying such practices -- a combination that will enlighten students not only about the art itself, but about the nature and function of art history, art criticism, and theory.  (AP)","title":"Contemporary Art Practices","description":"Introduction to the range of contemporary art modalities in light of the socio-political context in which they arose or flourished, with a view to illuminating the ideas and ambitions embedded within this challenging, anti-traditional work. The course will address both the practices of the visual arts (style, genre, media, movements), and the multiple theoretical bases for justifying such practices -- a combination that will enlighten students not only about the art itself, but about the nature and function of art history, art criticism, and theory.  (AP)"},{"course_num":"185","hours":"4","department":"ARTS","credits":"3","text":"AIV. 8 PLAS\nARTS 185. Contemporary Art in a Global Society\n4 hr., 3 cr.; Prereq: none\nPrereq: none\nThe various ways that artists have learned to interact with a world constantly made smaller and more complex, thanks to the impact of new technologies and globalization. While the primary focus of the course is art made since the 1960s, some comparison to past artistic practices is included and considered essential for the development of critical judgment. Through a combination of lectures, readings, research, and studio workshops students will explore the theories, techniques, and formal vocabulary of contemporary art (painting, sculpture, or another medium, which may vary from professor to professor within the same basic framework of issues and projects) from a variety of cultural settings; compare and contrast these findings with past practices; and ultimately fabricate their own artistic design projects, while relating this work to an area of chosen research before the entire class. (AP, WC)","title":"Contemporary Art in a Global Society","description":"The various ways that artists have learned to interact with a world constantly made smaller and more complex, thanks to the impact of new technologies and globalization. While the primary focus of the course is art made since the 1960s, some comparison to past artistic practices is included and considered essential for the development of critical judgment. Through a combination of lectures, readings, research, and studio workshops students will explore the theories, techniques, and formal vocabulary of contemporary art (painting, sculpture, or another medium, which may vary from professor to professor within the same basic framework of issues and projects) from a variety of cultural settings; compare and contrast these findings with past practices; and ultimately fabricate their own artistic design projects, while relating this work to an area of chosen research before the entire class. (AP, WC)"},{"course_num":"","department":"4 hr.","text":"AIV. 9 PLAS\nENSCI 100 Our Planet in the 21st Century: Challenges to Humanity\n4 hr., 4 cr.; Prereq: none\nIntroduction to how knowledge in environmental science is obtained to address the pressing issues of global climate change and to understand the risks humans face when exposed to pollutants. Exploration of the interactions between humans and the environment that have motivated and defined the research questions in environmental science. (NS-L, US)","title":"4 cr","description":"ENSCI 100 Our Planet in the 21st Century: Challenges to Humanity"},{"course_num":"","department":"3 hr.","text":"AIV. 10 PLAS\nGRKMD 250 Modern Greek Cinema\n3 hr., 3 cr.; Prereq: none\nThe contributions of Greek filmmakers to the art form of cinema. Students will learn the history of cinema in Greece and will study the forms and genres of Greek film, the terminology associated with film criticism and how to write a film analysis. The course will examine how Greeks have been portrayed in the cinema of the last half century, both in Greece and in Greek-America. Films will also be discussed and analyzed for their specific thematic and filmic content. (AP, ET)","title":"3 cr","description":"GRKMD 250 Modern Greek Cinema"},{"prereq":"","course_num":"210","hours":"3","department":"EURO","credits":"3","text":"AIV. 11 PLAS\nEURO 210. The Enlightenment.\n3 hr., 3 cr.; Prereq: English 110, two semesters of instruction in one foreign language (or permission of the department).\nPrereq: English 110, two semesters of instruction in one foreign language (or permission of the department).\nIntroduction to late seventeenth and eighteenth-century European thought through analysis and discussion of several major literary, philosophical, and artistic works of the period, notably Vico's New Science, Behn's Oroonoko, Defoe's Robinson Crusoe, Graffigny’s Letters from a Peruvian Woman, Voltaire's Candide, Rousseau's Discourse on the Origin of Inequality as well as excerpts from works by Locke, Kant, Diderot, Herder and others. The focus will be eighteenth-century representations of non-European cultures. Among the topics we will consider are: Enlightenment universalism and its critics, philosophical travelers, the nature of exoticism, the myth of the &quot;Noble Savage,&quot; and the relation of literary/artistic creation to political, economic, and historical contexts.  (CV, ET, PI)","title":"The Enlightenment","description":"Introduction to late seventeenth and eighteenth-century European thought through analysis and discussion of several major literary, philosophical, and artistic works of the period, notably Vico's New Science, Behn's Oroonoko, Defoe's Robinson Crusoe, Graffigny’s Letters from a Peruvian Woman, Voltaire's Candide, Rousseau's Discourse on the Origin of Inequality as well as excerpts from works by Locke, Kant, Diderot, Herder and others. The focus will be eighteenth-century representations of non-European cultures. Among the topics we will consider are: Enlightenment universalism and its critics, philosophical travelers, the nature of exoticism, the myth of the &quot;Noble Savage,&quot; and the relation of literary/artistic creation to political, economic, and historical contexts.  (CV, ET, PI)"},{"course_num":"160","hours":"3","department":"HIST","credits":"3","text":"AIV. 12 PLAS\nHIST 160. Global History: World (VT)\n3 hr., 3 cr. Prereq: none\nPrereq: none\nThe historic development of nations, institutions within nations, social movements, and historic trends across national borders. Comparative history, international relationships, and cross-national influences will be considered. The course will focus social institutions, political and social structures, governments, or nations on topics on world global history such as comparative world slavery and colonization and freedom struggles. (SS, WC)","title":"Global History","description":"The historic development of nations, institutions within nations, social movements, and historic trends across national borders. Comparative history, international relationships, and cross-national influences will be considered. The course will focus social institutions, political and social structures, governments, or nations on topics on world global history such as comparative world slavery and colonization and freedom struggles. (SS, WC)"},{"course_num":"164","hours":"3","department":"HIST","credits":"3","text":"AIV. 13 PLAS\nHIST 164. Social and Cultural History: European (VT)\n3 hr., 3 cr. Prereq: none\nPrereq: none\nSocial groups and their institutions, and culture in the broad sense of how people lived, thought, and their beliefs and values. The course will emphasize the interaction of classes, ethnic, and religious groups within a particular society or societies. Attention will be paid to differences between social history and other kinds of history focusing on the people--the assembly, the army, the congregation, the social activities, and social movements arising from the people, how the knowledge of their experiences inform the inquiry into broad issues, such as social inequality, the construction of nations and citizens, ongoing struggles over rights, and the formation of personal and group identities. The course will also explore collective values and expectations of certain historical populations and how these values and expectations changed over time. (SS, ET)","title":"Social and Cultural History","description":"Social groups and their institutions, and culture in the broad sense of how people lived, thought, and their beliefs and values. The course will emphasize the interaction of classes, ethnic, and religious groups within a particular society or societies. Attention will be paid to differences between social history and other kinds of history focusing on the people--the assembly, the army, the congregation, the social activities, and social movements arising from the people, how the knowledge of their experiences inform the inquiry into broad issues, such as social inequality, the construction of nations and citizens, ongoing struggles over rights, and the formation of personal and group identities. The course will also explore collective values and expectations of certain historical populations and how these values and expectations changed over time. (SS, ET)"},{"course_num":"166","hours":"3","department":"HIST","credits":"3","text":"AIV. 14 PLAS\nHIST 166. History and Memory (VT)\n3 hr., 3 cr. Prereq: none\nPrereq: none\nHow history is remembered and how the memory of history contributes to and differs from the writing of history. The course will explore how historic events are commemorated and what this tells us about the values and beliefs of those commemorating, how different cultures and groups remember history and the role that institutionalized social structures play in the remembrance of history. Attention will be paid the nature of the discipline of history and the role historic memory and oral history play in the disciple. Topic will be announced at registration time. (CV, WC)","title":"History and Memory ","description":"How history is remembered and how the memory of history contributes to and differs from the writing of history. The course will explore how historic events are commemorated and what this tells us about the values and beliefs of those commemorating, how different cultures and groups remember history and the role that institutionalized social structures play in the remembrance of history. Attention will be paid the nature of the discipline of history and the role historic memory and oral history play in the disciple. Topic will be announced at registration time. (CV, WC)"},{"course_num":"168","hours":"3","department":"HIST","credits":"3","text":"AIV. 15 PLAS\nHIST 168. History and Memory- The United States (VT)\n3 hr., 3 cr. Prereq: none\nPrereq: none\nHow history is remembered and how the memory of history contributes to and differs from the writing of history. Attention will be paid to how historic events are commemorated and what this tells us about the values and beliefs of those commemorating. The course will explore how different cultures and groups remember history and the role that institutionalized social structures play in the remembrance of history. Attention will also be paid to the nature of the discipline of history and the role historic memory and oral history play in the discipline. Topic will be announced at registration time. (CV, US)","title":"History and Memory","description":"How history is remembered and how the memory of history contributes to and differs from the writing of history. Attention will be paid to how historic events are commemorated and what this tells us about the values and beliefs of those commemorating. The course will explore how different cultures and groups remember history and the role that institutionalized social structures play in the remembrance of history. Attention will also be paid to the nature of the discipline of history and the role historic memory and oral history play in the discipline. Topic will be announced at registration time. (CV, US)"},{"course_num":"100","hours":"3","department":"LCD","credits":"3","text":"AIV. 16 PLAS\nLCD 100, Language in Context\n3 hr., 3 cr. Prereq: none\nPrereq: none\nThe study of linguistics from the social, educational, and work-related contexts in which language is used. Within these contexts, linguistic concepts are introduced and explained. (CV)","title":"Language in Context","description":"The study of linguistics from the social, educational, and work-related contexts in which language is used. Within these contexts, linguistic concepts are introduced and explained. (CV)"},{"course_num":"","department":"3 hr.","text":"AIV. 17 PLAS\nLCD 144 Language and Social Diversity\n3 hr., 3 cr.; Prereq: none\nA research-based course involving sociolinguistics with an international focus, designed for undergraduates with no background in the field. Students explore sociolinguistic research through reading representative but accessible studies and through their own carefully structured research projects. Typical questions addressed in the studies involve the association of different languages, dialects, and speech styles with ways social structures and norms such as  how specific languages or dialects are used preferentially by individuals belonging to different social categories, how these different groups preferentially observe different norms of oral and written language behaviors, why certain languages or varieties of languages become dominant or lose their privileged position and why they can even disappear and why and how languages or dialects evolve.  (SS, WC)","title":"3 cr","description":"LCD 144 Language and Social Diversity"},{"course_num":"103","department":"URBST","text":"AIV. 18 PLAS\nURBST 103. Urban Diversity\n3 hr 3 cr\nAn introduction to the study of urban diversity in the United States. It explores the different forms of identity, community and cultural belonging that dot the urban landscape, and analyzes the historical, social, political, and economic forces that shape the everyday lives of diverse urban populations. The course also analyzes debates over migration, assimilation, pluralism, multiculturalism, and cosmopolitanism and introduces students to urban studies’ multidisciplinary approaches for the study of diversity and inequality. (SS, US)","title":"Urban Diversity","description":"3 hr 3 cr"},{"course_num":"","department":"Hours and Credits","approval_date":"2/5/09","description":"Course number and title: SEYSG 550","prereq":"An examination of the New York Standards, Best Practices and the Principles of Learning","justification":"Education and Community Programs Department (ECP) and Secondary Education and Youth Service","text":"AIV. 19 Secondary Education &amp; Youth Services (G08-49, approved by Academic Senate 2/5/09)\nCourse number and title: SEYSG 550\nSeminar in Interdisciplinary Teaching at the Secondary Level: Part I\nHours and Credits: 3 hrs., 3 cr.\nPrerequisites or Co requisites: SEYS 536, SEYS 552, and SEYS 700. Open only to students accepted into the Middle School Generalist Special Education program (Alternative B) program. Description: An examination of the New York Standards, Best Practices and the Principles of Learning. Students will come to understand how research and theory guide models and methods of teaching content at the secondary level. Students will gain experience using effective strategies and reflecting upon their own teaching practices. This course weaves language, literacy and culture in teaching specific content areas.\nStudents will come to understand how research and theory guide models and methods of teaching content at the secondary level. Students will gain experience using effective strategies and reflecting upon their own teaching practices. This course weaves language, literacy and culture in teaching specific content areas.\nIn Part I, candidates will focus on researching the following assessments\n:\nState, City, authentic, and performance. These assessments will be both formal and informal but all the assessments are relevant to students in secondary classrooms.  Candidates will gain an insight into aligning content with testing strategies.\nJustification: The Middle School Generalist Special Education program (Alternative B) is a collaborative program of two Departments in the Division of Education: Education and Community Programs Department (ECP) and Secondary Education and Youth Service\ns\nDepartment (SEYS). For this graduate level program, students are required to take 21 education credits in the Department of Secondary Education and Youth Services in fulfillment of initial certification in teaching. Upon completion of these courses, students continue their coursework in the Education and Community Programs Department leading to a Masters degree in Special Education.  To meet the requirements of initial certification in a Middle Generalist program in Special Education at the graduate level, students are required to take two general or interdisciplinary curriculum courses. This proposed new course is the first of two required general or interdisciplinary courses of the Middle Generalist Special Education program (Alternative B).","id":"19","title":"3 hrs","disp":"Secondary Education &amp; Youth Services"},{"course_num":"551","hours":"3","department":"SEYSG","credits":"3","approval_date":"2/5/09","description":"Open only to students accepted into the Middle School Generalist Special Education program (Alternative B) program.  Continuation of SEYSG 550. Candidates will design an interdisciplinary unit of study.  Instruction will focus on concept- based curriculum, teaching responsively and gathering materials for the unit of the study.  Candidates will rely on the assessment skills learned in part one of the course, while teaching the unit to their middle school students.","prereq":"SEYSG 550","justification":"Education and Community Programs Department (ECP) and Secondary Education and Youth Service Department (SEYS). For this graduate level program, students are required to take 21 education credits in the Department of Secondary Education and Youth Services in fulfillment of initial certification in teaching. Upon completion of these courses, students continue their coursework in the Education and Community Programs Department leading to a Masters degree in Special Education.  To meet the requirements of initial certification in a Middle Generalist program in Special Education at the graduate level, students are required to take two general or interdisciplinary curriculum courses. This proposed new course is the second of two required general or interdisciplinary courses of the Middle Generalist Special Education program (Alternative B).","text":"AIV. 20 Secondary Education &amp; Youth Services (G08-50, approved by Academic Senate 2/5/09)\nSEYSG 551. Seminar in Interdisciplinary Teaching at the Secondary Level: Part II\nHours and Credits: 3 hrs., 3 cr. Prerequisites or Co requisites: SEYSG 550. Open only to students accepted into the Middle School Generalist Special Education program (Alternative B) program.  Continuation of SEYSG 550. Candidates will design an interdisciplinary unit of study.  Instruction will focus on concept- based curriculum, teaching responsively and gathering materials for the unit of the study.  Candidates will rely on the assessment skills learned in part one of the course, while teaching the unit to their middle school students.\nPrerequisites or Co requisites: SEYSG 550. Open only to students accepted into the Middle School Generalist Special Education program (Alternative B) program.  Continuation of SEYSG 550. Candidates will design an interdisciplinary unit of study.  Instruction will focus on concept- based curriculum, teaching responsively and gathering materials for the unit of the study.  Candidates will rely on the assessment skills learned in part one of the course, while teaching the unit to their middle school students.\nOpen only to students accepted into the Middle School Generalist Special Education program (Alternative B) program.  Continuation of SEYSG 550. Candidates will design an interdisciplinary unit of study.  Instruction will focus on concept- based curriculum, teaching responsively and gathering materials for the unit of the study.  Candidates will rely on the assessment skills learned in part one of the course, while teaching the unit to their middle school students.\nJustification: The Middle School Generalist Special Education program (Alternative B) is a collaborative program of two Departments in the Division of Education: Education and Community Programs Department (ECP) and Secondary Education and Youth Service Department (SEYS). For this graduate level program, students are required to take 21 education credits in the Department of Secondary Education and Youth Services in fulfillment of initial certification in teaching. Upon completion of these courses, students continue their coursework in the Education and Community Programs Department leading to a Masters degree in Special Education.  To meet the requirements of initial certification in a Middle Generalist program in Special Education at the graduate level, students are required to take two general or interdisciplinary curriculum courses. This proposed new course is the second of two required general or interdisciplinary courses of the Middle Generalist Special Education program (Alternative B).\nProjected Enrollment: 20-25","id":"20","title":"Seminar in Interdisciplinary Teaching at the Secondary Level","disp":"Secondary Education &amp; Youth Services"},{"course_num":"","hours":"3","department":"LBSCI 764 Instructional Technologies for Information Literacy","credits":"3","approval_date":"3/12/09","description":"Evaluation, selection, and utilization of appropriate instructional technologies to serve the needs of all members of the school community. Emphasis on information literacy and methods and formats supportive of diverse learners.","prereq":"GSLIS 700 or 706, 702, 703","justification":"Sources and Services is no longer a timely address of library resources. It was based on an earlier paradigm which separated print from digital and other non-print resources. A more timely address of resources is according to their value and appropriateness for a particular situation and population. All resources, therefore, will be addressed in GSLIS 765. LBSCI 764 will address how the appropriate instructional technologies can be implemented so that resources become tools for teaching and learning in the school library.  In particular, methods of teaching information literacy will be emphasized as well as methods and formats that support students with diverse needs and backgrounds.","text":"AIV.21 Graduate School of Library and Information Studies (G09-03, approved by Academic Senate 3/12/09)\nLBSCI 764 Instructional Technologies for Information Literacy.  3 hr.; 3 cr. Prereq. or coreq.: GSLIS 700 or 706, 702, 703.\nLBSCI 764. Instructional Technologies for Information Literacy. 3 hr.; 3 cr. Prereq. or coreq.: GSLIS 700 or 706, 702, 703. Evaluation, selection, and utilization of appropriate instructional technologies to serve the needs of all members of the school community. Emphasis on information literacy and methods and formats supportive of diverse learners.\nPrereq. or coreq.: GSLIS 700 or 706, 702, 703. Evaluation, selection, and utilization of appropriate instructional technologies to serve the needs of all members of the school community. Emphasis on information literacy and methods and formats supportive of diverse learners.\nEvaluation, selection, and utilization of appropriate instructional technologies to serve the needs of all members of the school community. Emphasis on information literacy and methods and formats supportive of diverse learners.\nRationale:  GSLIS 763, Non-Book Materials: Sources and Services is no longer a timely address of library resources. It was based on an earlier paradigm which separated print from digital and other non-print resources. A more timely address of resources is according to their value and appropriateness for a particular situation and population. All resources, therefore, will be addressed in GSLIS 765. LBSCI 764 will address how the appropriate instructional technologies can be implemented so that resources become tools for teaching and learning in the school library.  In particular, methods of teaching information literacy will be emphasized as well as methods and formats that support students with diverse needs and backgrounds.","id":"21","title":"3 hr","disp":"Graduate School of Library and Information Studies"}]