[{"course_num":"","department":"RESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Good Samaritan Hospital to enable students enrolled in the College's speech and hearing program in the Department of Linguistics and Communications Disorders to obtain the appropriate clinical experience necessary for the completion of degree requirements","text":"AII.5B.1 ITEM DELETED\nAIII – 5A.1\nAgreement with Good Samaritan Hospital\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Good Samaritan Hospital to enable students enrolled in the College's speech and hearing program in the Department of Linguistics and Communications Disorders to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Good Samaritan Hospital will fulfill the clinical training required for the speech and hearing program of the College’s Department of Linguistics and Communications Disorders.\nAIII – 5A.2\nAgreement with The Mount Sinai Hospital of Queens\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with The Mount Sinai Hospital of Queens to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at The Mount Sinai Hospital of Queens will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.3\nAgreement with Kingsbrook Jewish Medical Center\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Kingsbrook Jewish Medical Center to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Kingsbrook Jewish Medical Center will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.4\nAgreement with Department of Veterans Affairs New York Harbor Healthcare System\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with the Department of Veterans Affairs New York Harbor Healthcare System to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at the Department of Veterans Affairs New York Harbor Healthcare System will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.5\nAgreement with Visiting Nurse Services of New York\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Visiting Nurse Services of New York to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Visiting Nurse Services of New York will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.6\nAgreement with Parker Jewish Geriatric Center\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Parker Jewish Geriatric Center to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Parker Jewish Geriatric Center will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.7\nAgreement with Ozanam Hall\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Ozanam Hall to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Ozanam Hall will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.8\nAgreement with Flushing Manor Nursing and Rehabilitation Center\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Flushing Manor Nursing and Rehabilitation Center to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Flushing Manor Nursing and Rehabilitation Center will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.9\nAgreement with Franklin Nursing Center for Rehabilitation and Nursing\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Franklin Nursing Center for Rehabilitation and Nursing to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Franklin Nursing Center for Rehabilitation and Nursing will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.10\nAgreement with Cornell University Cooperative Extension New York City\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Cornell University Cooperative Extension New York City to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Cornell University Cooperative Extension New York City will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.11\nAgreement with Dr. William O. Benenson Rehabilitation Pavilion\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with the Dr. William O. Benenson Rehabilitation Pavilion to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at the Dr. William O. Benenson Rehabilitation Pavilion will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.12\nAgreement with North Shore University Hospital at Syosset\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with North Shore University Hospital at Syosset to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at North Shore University Hospital at Syosset will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.13\nAgreement with Franklin Hospital – North Shore-Long Island Jewish Health System\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Franklin Hospital – North Shore-Long Island Jewish Health System  to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Franklin Hospital – North Shore-Long Island Jewish Health System will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.14\nAgreement with North Shore University Hospital at Glen Cove\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with North Shore University Hospital at Glen Cove to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at North Shore University Hospital at Glen Cove will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.15\nAgreement with North Shore University Hospital – Forest Hills\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with North Shore University Hospital – Forest Hills to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at North Shore University Hospital – Forest Hills will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.\nAIII – 5A.16\nAgreement with Parker Jewish Geriatric Center\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Parker Jewish Geriatric Center to enable students enrolled in the College's speech and hearing program in the Department of Linguistics and Communications Disorders to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Parker Jewish Geriatric Center will fulfill the clinical training required for the speech and hearing program of the College’s Department of Linguistics and Communications Disorders.","title":"Neither party to this agreement is obligated to pay any monetary consideration to the other","description":"AIII – 5A.1"}]