[{"course_num":"264","hours":"3","credits":"3","approval_date":"4/6/06","description":"Approaches to improving U.S. security, and contending explanations for U.S. security policies. This course engages contemporary security policy debates concerning terrorism, proliferation, and regional powers. Examination of the sources of U.S. military strategies, defense spending, and wars, including international incentives and constraints, as well as domestic political, cultural, and psychological influences. ","text":"AII.5A.1 Political Science (06-03, approved by Academic Senate 4/6/06)\nPSCI 264. American Security Policy\n3 hr.; 3 cr.\nApproaches to improving U.S. security, and contending explanations for U.S. security policies. This course engages contemporary security policy debates concerning terrorism, proliferation, and regional powers. Examination of the sources of U.S. military strategies, defense spending, and wars, including international incentives and constraints, as well as domestic political, cultural, and psychological influences. \nJustification: This course has been taught four times, under the rubric of PSCI 262: Contemporary Issues in International Relations: US Military Policy. This course differs from others in the catalog or taught at QC. PSCI 262: U.S. Foreign Policy, gives equal attention to history, international institutions, international political economy, and human rights as to security. There is simply not enough time to get important issues in depth such as: how control over information biases, national debates on military intervention, the sources and consequences of civil-military conflict, the influence of the military-industrial complex, and why counter-insurgency and establishing democracy by force is so difficult. ","justification":"how control over information biases, national debates on military intervention, the sources and consequences of civil-military conflict, the influence of the military-industrial complex, and why counter-insurgency and establishing democracy by force is so difficult. ","id":"1","title":"American Security Policy","disp":"Political Science"},{"course_num":"10","hours":"3","credits":"3","approval_date":"4/6/06","description":"This course provides a thorough presentation of Italian grammar and introduces students to expository prose in Italian with the emphasis on reading and translation. Does not count toward the foreign language requirement or the major and minor.","prereq":"Graduate standing or permission of the department. No previous study of Italian required. ","justification":"This new course parallels French 10. It reflects the necessity in providing training in reading comprehension for students without previous knowledge of the language who need these skills to be able to read a variety of texts and to carry out research in different fields, such as history, art, musicology, and other fields. ","text":"AII.5A.2 European Languages and Literatures (05-24, approved by Academic Senate 4/6/06)\nItalian 10. Italian for Reading and Translation I. \n3hr., 3 cr.; Prerequisite: Graduate standing or permission of the department. No previous study of Italian required. \nPrerequisite: Graduate standing or permission of the department. No previous study of Italian required. \nThis course provides a thorough presentation of Italian grammar and introduces students to expository prose in Italian with the emphasis on reading and translation. Does not count toward the foreign language requirement or the major and minor.\nJustification: This new course parallels French 10. It reflects the necessity in providing training in reading comprehension for students without previous knowledge of the language who need these skills to be able to read a variety of texts and to carry out research in different fields, such as history, art, musicology, and other fields. ","id":"2","title":"Italian for Reading and Translation I","disp":"European Languages and Literatures"},{"course_num":"11","hours":"3","credits":"3","approval_date":"4/6/06","description":"Continuation of Italian 10 with reading and translation of longer and more complex texts. Does not count toward the foreign language requirement or the major and minor. ","prereq":"Italian 10. ","justification":"This new course parallels French 11, providing further training in reading comprehension.","text":"AII.5A.3 European Languages and Literatures (05-24, approved by Academic Senate 4/6/06)\nItalian 11. Italian for Reading and Translation II. \n3hr., 3 cr.; Prerequisite: Italian 10. \nPrerequisite: Italian 10. \nContinuation of Italian 10 with reading and translation of longer and more complex texts. Does not count toward the foreign language requirement or the major and minor. \nJustification: This new course parallels French 11, providing further training in reading comprehension.","id":"3","title":"Italian for Reading and Translation II","disp":"European Languages and Literatures"},{"course_num":"","hours":"3","credits":"3","approval_date":"5/4/06","description":"In this course students will focus on curriculum, instruction and assessment for teaching elementary classroom music. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies and technologies for supporting student learning as defined by city, state and national standards for music education. Strategies for adapting instruction to students with specific types of exceptionalities will be explored. There is an intensive field component to this class that allows students the opportunity to teach and then reflect on their experiences with children. Biweekly observations are also required. Students must pass this course with a B or higher to continue on to MUS 366.","prereq":"EECE  310. ","text":"AII.5A.4 Music (06-07, approved by Academic Senate 5/4/06)\nMUS 365. Seminar in Teaching Music: Elementary. \n3 hr.; 3 cr. Prereq.: MUS 267, SEYS 201, SEYS 221; Co-requisite: EECE  310. \nPrereq.: MUS 267, SEYS 201, SEYS 221; Co-requisite: EECE  310. \nIn this course students will focus on curriculum, instruction and assessment for teaching elementary classroom music. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies and technologies for supporting student learning as defined by city, state and national standards for music education. Strategies for adapting instruction to students with specific types of exceptionalities will be explored. There is an intensive field component to this class that allows students the opportunity to teach and then reflect on their experiences with children. Biweekly observations are also required. Students must pass this course with a B or higher to continue on to MUS 366.","id":"4","title":"Elementary","disp":"Music"},{"course_num":"","hours":"3","credits":"3","approval_date":"5/4/06","description":"In this course students will focus on curriculum, instruction and assessment for teaching secondary general music including music in middle schools. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies for supporting student learning as defined by city, state and national standards for music education. Students will learn and practice strategies for teaching music from a multicultural perspective. There is an intensive field component to this class that allows students the opportunity to teach and then reflect on their experiences with children. Weekly observations are also required. Students must pass this course with a B or higher to be allowed to student teach.","prereq":"EECE 340 or SEYS 340. ","justification":"These two courses are intended to replace the existing single course MUS 367 – Seminar in Teaching Music. 4 hr.; 4 cr. This course (MUS 367) meets twice a week (2 hrs. each day) and is taught by two faculty – one an elementary specialist, the other a secondary specialist. With the recent increased requirements of the New York State Education Department in the areas of technology, special learners and multiculturalism, the faculty teaching this course currently feel that the combined four hours a week is insufficient time to cover these topics adequately. We feel that the educational/pedagogical advantages more than justify the additional two hours and two credits. It should be noted that the additional two credits created by this split do not add to the degree requirements. The change is one of replacing two elective credits with two required credits which we feel will significantly strengthen the program as this is the final program phase before student teaching. The existing course (MUS 367) will be phased out after the Fall, 2006 semester.","text":"AII.5A.5 Music (06-07, approved by Academic Senate 5/4/06)\nMUS 366. Seminar in Teaching Music: Secondary. \n3hr.; 3 cr. Prerequisite: MUS  365 with a minimum grade of B. Co-requisite: EECE 340 or SEYS 340. \nPrerequisite: MUS  365 with a minimum grade of B. Co-requisite: EECE 340 or SEYS 340. \nIn this course students will focus on curriculum, instruction and assessment for teaching secondary general music including music in middle schools. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies for supporting student learning as defined by city, state and national standards for music education. Students will learn and practice strategies for teaching music from a multicultural perspective. There is an intensive field component to this class that allows students the opportunity to teach and then reflect on their experiences with children. Weekly observations are also required. Students must pass this course with a B or higher to be allowed to student teach.\nJustification for both courses: These two courses are intended to replace the existing single course MUS 367 – Seminar in Teaching Music. 4 hr.; 4 cr. This course (MUS 367) meets twice a week (2 hrs. each day) and is taught by two faculty – one an elementary specialist, the other a secondary specialist. With the recent increased requirements of the New York State Education Department in the areas of technology, special learners and multiculturalism, the faculty teaching this course currently feel that the combined four hours a week is insufficient time to cover these topics adequately. We feel that the educational/pedagogical advantages more than justify the additional two hours and two credits. It should be noted that the additional two credits created by this split do not add to the degree requirements. The change is one of replacing two elective credits with two required credits which we feel will significantly strengthen the program as this is the final program phase before student teaching. The existing course (MUS 367) will be phased out after the Fall, 2006 semester.","id":"5","title":"Secondary","disp":"Music"},{"course_num":"752","hours":"3","credits":"3","approval_date":"5/4/06","description":"The course examines the Uniform Commercial Code, with particular emphasis on sales law, commercial paper, and the laws of secured transactions.  Laws relating to bankruptcy, suretyship, as well as laws specifically applicable to accountants’ professional responsibilities, including securities laws and corporate governance, will also be examined.","text":"AII.5B.1 Accounting (G06-01, approved by Academic Senate 5/4/06)\nACCT 752.  Advanced Studies in Business Law. 3 hr., 3 cr. \nThe course examines the Uniform Commercial Code, with particular emphasis on sales law, commercial paper, and the laws of secured transactions.  Laws relating to bankruptcy, suretyship, as well as laws specifically applicable to accountants’ professional responsibilities, including securities laws and corporate governance, will also be examined.\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program.):  The Department is proposing moving the undergraduate course, ACCT 363 (Business Law III), to the graduate level as a required course.  In reformulating the Department’s 150 credit program to establish student eligibility to sit for the Uniform CPA Examination, this proposed course would provide more specialized content and examine complex subject matter suitable at the graduate level.     \nProjected Enrollment:  30 students \nProjected Frequency:   Offered each semester","justification":"The Department is proposing moving the undergraduate course, ACCT 363 (Business Law III), to the graduate level as a required course.  In reformulating the Department’s 150 credit program to establish student eligibility to sit for the Uniform CPA Examination, this proposed course would provide more specialized content and examine complex subject matter suitable at the graduate level.     ","id":"1","title":"Advanced Studies in Business Law","disp":"Accounting"},{"course_num":"700","approval_date":"5/4/06","description":"Stylistic and grammatical analyses of readings of literary and nonliterary texts are combined with in-depth discussions and intensive writing.  This course emphasizes the writing process: developing theses, structuring arguments, and generating a clear and cohesive style.","text":"AII.5B.2 Hispanic Languages and Literatures (G06-04, approved by Academic Senate 5/4/06)\nSpanish 700. Stylistics and Composition. 2 hr. plus conf.; 3 cr. Prereq.: Admission to the M. A. Program. \nStylistic and grammatical analyses of readings of literary and nonliterary texts are combined with in-depth discussions and intensive writing.  This course emphasizes the writing process: developing theses, structuring arguments, and generating a clear and cohesive style.\nRationale: This course will provide additional review and upgrading of languages skills for our graduate students.  It will serve as a measure of linguistic proficiency prior to completing the degree.\nProjected Enrollment: 15\nProjected Frequency: Every 2 semesters","justification":"This course will provide additional review and upgrading of languages skills for our graduate students.  It will serve as a measure of linguistic proficiency prior to completing the degree.","id":"2","title":"Stylistics and Composition","disp":"Hispanic Languages and Literatures"},{"course_num":"704","approval_date":"5/4/06","description":"This course provides an introduction to Spanish Linguistics and establishes the basis for future application of linguistic principles. The course begins with an exploration of the sound system of Spanish and its theoretical representation.  Building on this, the discussion continues with topics in Spanish morphology such as word formation and verbal inflection. This is followed by issues in syntax and semantics that are analyzed both in isolation and in terms of their relationship to each other. ","text":"AII.5B.3 Hispanic Languages and Literatures (G06-06, approved by Academic Senate 5/4/06)\nSpanish 704. Foundations of Hispanic Linguistics. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption\nThis course provides an introduction to Spanish Linguistics and establishes the basis for future application of linguistic principles. The course begins with an exploration of the sound system of Spanish and its theoretical representation.  Building on this, the discussion continues with topics in Spanish morphology such as word formation and verbal inflection. This is followed by issues in syntax and semantics that are analyzed both in isolation and in terms of their relationship to each other. \nRationale: An introductory course in Spanish Linguistics is an integral component of a graduate program in Hispanic Languages and Literatures.  The goal of this course is to provide students with a level of knowledge that enables them to make connections between the structure of Spanish and relevant issues in literature and contemporary Hispanic linguistics.\nProjected Enrollment: 35\nProjected Frequency: Every 3 semesters","justification":"An introductory course in Spanish Linguistics is an integral component of a graduate program in Hispanic Languages and Literatures.  The goal of this course is to provide students with a level of knowledge that enables them to make connections between the structure of Spanish and relevant issues in literature and contemporary Hispanic linguistics.","id":"3","title":"Foundations of Hispanic Linguistics","disp":"Hispanic Languages and Literatures"},{"course_num":"706","approval_date":"5/4/06","description":"This course is intended to familiarize students with the study of Spanish dialects based on historical and geographic criteria, as well as to introduce sociolinguistic concepts and issues. Sociolinguistic topics may include social and stylistic variation, language variation and change, dialects and the “standard norm,” linguistic attitudes, language and gender, bilingualism, language contact, language attitudes, discourse analysis, etc.","text":"AII.5B.4 Hispanic Languages and Literatures (G06-07, approved by Academic Senate 5/4/06)\nSpanish 706. Hispanic Sociolinguistics and Dialectology. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThis course is intended to familiarize students with the study of Spanish dialects based on historical and geographic criteria, as well as to introduce sociolinguistic concepts and issues. Sociolinguistic topics may include social and stylistic variation, language variation and change, dialects and the “standard norm,” linguistic attitudes, language and gender, bilingualism, language contact, language attitudes, discourse analysis, etc.\nRationale: This course will enrich the Hispanic Language and Literature graduate curriculum by exposing students to sociolinguistics and dialectology issues in the contemporary world. Students will understand the role of language in society and how society also impacts language use. In addition, this course will help students develop critical skills in applying theoretical sociolinguistics principles to the acquisition of Spanish as a foreign language and bilingual education theories. Students will learn how to use  the acquired sociolinguistics knowledge for development of more efficient language classrooms for culturally and linguistically diverse student populations.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"This course will enrich the Hispanic Language and Literature graduate curriculum by exposing students to sociolinguistics and dialectology issues in the contemporary world. Students will understand the role of language in society and how society also impacts language use. In addition, this course will help students develop critical skills in applying theoretical sociolinguistics principles to the acquisition of Spanish as a foreign language and bilingual education theories. Students will learn how to use  the acquired sociolinguistics knowledge for development of more efficient language classrooms for culturally and linguistically diverse student populations.","id":"4","title":"Hispanic Sociolinguistics and Dialectology","disp":"Hispanic Languages and Literatures"},{"course_num":"722","approval_date":"5/4/06","description":"The study of key issues of the Renaissance as a cultural phenomenon, such as the question of language, literary ideas and currents, utopian thinking, the nature and education of man, religious and political thought, speculation on love, and the issue of the American Indian. Representative works of different genres will be examined from this perspective.","text":"AII.5B.5 Hispanic Languages and Literatures (G06-09, approved by Academic Senate 5/4/06)\nSpanish 722. Golden Age Spanish Literature. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThe study of key issues of the Renaissance as a cultural phenomenon, such as the question of language, literary ideas and currents, utopian thinking, the nature and education of man, religious and political thought, speculation on love, and the issue of the American Indian. Representative works of different genres will be examined from this perspective.\nRationale: This new course incorporates material formerly included in Spanish 711, 712 and 713 (Studies in Golden Age as divided by genre). It maintains the period boundaries, while allowing for more freedom in combining the same materials, making possible courses such as those mentioned in the Description, not possible in the old “genre” format.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"This new course incorporates material formerly included in Spanish 711, 712 and 713 (Studies in Golden Age as divided by genre). It maintains the period boundaries, while allowing for more freedom in combining the same materials, making possible courses such as those mentioned in the Description, not possible in the old “genre” format.","id":"5","title":"Golden Age Spanish Literature","disp":"Hispanic Languages and Literatures"},{"course_num":"724","approval_date":"5/4/06","description":"Study of the works of Miguel de Cervantes, along with related texts and with different perspectives and contexts.  It will alternate different combinations of  Don Quixote and other works by Cervantes.  Special attention will always be given to the issue of literary genres, narrative techniques and the historical-cultural context.","text":"AII.5B.6 Hispanic Languages and Literatures (G06-10, approved by Academic Senate 5/4/06)\nSpanish 724.  Cervantes. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption.\nStudy of the works of Miguel de Cervantes, along with related texts and with different perspectives and contexts.  It will alternate different combinations of  Don Quixote and other works by Cervantes.  Special attention will always be given to the issue of literary genres, narrative techniques and the historical-cultural context.\nRationale: This new course combines materials formerly distributed among Spanish 710 (Cervantes’s Other Works) and Spanish 711 (Don Quixote), a conventional division that tends to create the illusion of two separate fields.  The course will allow for greater flexibility to combine different materials and read them as a unity.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"This new course combines materials formerly distributed among Spanish 710 (Cervantes’s Other Works) and Spanish 711 (Don Quixote), a conventional division that tends to create the illusion of two separate fields.  The course will allow for greater flexibility to combine different materials and read them as a unity.","id":"6","title":"Cervantes","disp":"Hispanic Languages and Literatures"},{"course_num":"726","approval_date":"5/4/06","description":"The course considers the development of liberalism and a new national identity in Spanish literature from the Age of Enlightenment through the post-colonial period. It will cover eighteenth-century essayists, the most important figures of Spanish romanticism (M. J. de Larra, J. Espronceda), and major exponents of realist fiction, in particular Benito Pérez Galdós and Leopoldo Alas, “Clarín.”","text":"AII.5B.7 Hispanic Languages and Literatures (G06-011, approved by Academic Senate 5/4/06)\nSpanish 726. Spanish Literature of the Eighteenth and Nineteenth Centuries. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThe course considers the development of liberalism and a new national identity in Spanish literature from the Age of Enlightenment through the post-colonial period. It will cover eighteenth-century essayists, the most important figures of Spanish romanticism (M. J. de Larra, J. Espronceda), and major exponents of realist fiction, in particular Benito Pérez Galdós and Leopoldo Alas, “Clarín.”\nRationale: Spanish writers of the French-inspired eighteenth century initiate a critical turn in the development of social criticism and literary expression which continues through nineteenth-century romanticism and realism, prefiguring the novels, poetry and essays of the later Generation of 1898.  The course will center on these Spanish versions of pan-European literary and cultural movements, and will provide a background for understanding Spanish literature of the twentieth century.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"Spanish writers of the French-inspired eighteenth century initiate a critical turn in the development of social criticism and literary expression which continues through nineteenth-century romanticism and realism, prefiguring the novels, poetry and essays of the later Generation of 1898.  The course will center on these Spanish versions of pan-European literary and cultural movements, and will provide a background for understanding Spanish literature of the twentieth century.","id":"7","title":"Spanish Literature of the Eighteenth and Nineteenth Centuries","disp":"Hispanic Languages and Literatures"},{"course_num":"728","approval_date":"5/4/06","description":"Study of authors spurred into literary activity by the impact of Spain’s colonial losses in Cuba, Puerto Rico and the Philippines. Emphasis on historical contexts, aesthetic movements in Europe, artistic influences from Latin America, and the critical ethos expressed by this “generation”: contrast/comparison of Modernismo y Noventaiochismo, the introduction of existentialism, the roots of krausismo, and the beginning of contemporary theatre.","text":"AII.5B.8 Hispanic Languages and Literatures (G06-012, approved by Academic Senate 5/4/06)\nSpanish 728. The Generation of 1898 and the Beginning of the Twentieth Century. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nStudy of authors spurred into literary activity by the impact of Spain’s colonial losses in Cuba, Puerto Rico and the Philippines. Emphasis on historical contexts, aesthetic movements in Europe, artistic influences from Latin America, and the critical ethos expressed by this “generation”: contrast/comparison of Modernismo y Noventaiochismo, the introduction of existentialism, the roots of krausismo, and the beginning of contemporary theatre.\nRationale: In contrast to the broader Modernismo course that it replaces, this new course focuses on the artistic and intellectual activity around the Spanish-American War of 1898 and its aftermaths.  The course imposes a closer scrutiny of its historical period in order to understand the woes of a nation in crisis, as well as the consequences of imperial policies and wars.\nProjected Enrollment: 20\nProjected Frequency: Every 3 semesters","justification":"In contrast to the broader Modernismo course that it replaces, this new course focuses on the artistic and intellectual activity around the Spanish-American War of 1898 and its aftermaths.  The course imposes a closer scrutiny of its historical period in order to understand the woes of a nation in crisis, as well as the consequences of imperial policies and wars.","id":"8","title":"The Generation of 1898 and the Beginning of the Twentieth Century","disp":"Hispanic Languages and Literatures"},{"course_num":"730","approval_date":"5/4/06","description":"The difficult years: A study of the Fascist and Anti-Fascist literature of the Franco era with an emphasis on the writers of Inner Exile and the emergence of an extremely important cadre of women writers. An analysis of the development of compromiso social in the various genres: la poesía social, la novela social y el teatro social. Works studied will include: Dámaso Alonso, José Hierro, Antonio Buero Vallejo, Alfonso Sastre, Juan Goytisolo, Carmen Laforet, Ana María Matute, Miguel Delibes, Carmen Martín Gaite, etc.","text":"AII.5B.9 Hispanic Languages and Literatures (G06-13, approved by Academic Senate 5/4/06)\nSpanish 730. Literature of the Franco Era. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThe difficult years: A study of the Fascist and Anti-Fascist literature of the Franco era with an emphasis on the writers of Inner Exile and the emergence of an extremely important cadre of women writers. An analysis of the development of compromiso social in the various genres: la poesía social, la novela social y el teatro social. Works studied will include: Dámaso Alonso, José Hierro, Antonio Buero Vallejo, Alfonso Sastre, Juan Goytisolo, Carmen Laforet, Ana María Matute, Miguel Delibes, Carmen Martín Gaite, etc.\nRationale: A course covering the period of the Dictatorship (1939-1975) and the reaction of, or acceptance by, the intellectuals, as well as public reaction to their output, is necessary to understand Spanish culture of the twentieth century.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"A course covering the period of the Dictatorship (1939-1975) and the reaction of, or acceptance by, the intellectuals, as well as public reaction to their output, is necessary to understand Spanish culture of the twentieth century.","id":"9","title":"Literature of the Franco Era","disp":"Hispanic Languages and Literatures"},{"course_num":"732","approval_date":"5/4/06","description":"The course examines the cultural change from Dictatorship to Democracy in Spain, and how literary practice can defend an ethical conscience based on a critical individualism against the tendency to homogenize, force consensus and relinquish independence.  Works read might include: Luis Goytisolo, Antonio Muñoz Molina, Lourdes Ortiz, Esther Tusquets, Manuel Vázquez Montalbán, Lucía Etxebarría, Fernando Savater, etc.","text":"AII.5B.10 Hispanic Languages and Literatures (G06-14, approved by Academic Senate 5/4/06)\nSpanish 732. Spanish Literature from the Transition to the Beginning of Democracy. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThe course examines the cultural change from Dictatorship to Democracy in Spain, and how literary practice can defend an ethical conscience based on a critical individualism against the tendency to homogenize, force consensus and relinquish independence.  Works read might include: Luis Goytisolo, Antonio Muñoz Molina, Lourdes Ortiz, Esther Tusquets, Manuel Vázquez Montalbán, Lucía Etxebarría, Fernando Savater, etc.\nRationale: A course covering the literature of the late twentieth and early twenty-first  centuries in Spain is not currently part of the graduate curriculum. The Transition to democracy was followed by a period of disillusion (el desencanto).  These are now common reference points for understanding intellectual and cultural changes which require study and analysis within a global framework.\nProjected Enrollment: 20\nProjected Frequency: Every 3 semesters","justification":"A course covering the literature of the late twentieth and early twenty-first  centuries in Spain is not currently part of the graduate curriculum. The Transition to democracy was followed by a period of disillusion (el desencanto).  These are now common reference points for understanding intellectual and cultural changes which require study and analysis within a global framework.","id":"10","title":"Spanish Literature from the Transition to the Beginning of Democracy","disp":"Hispanic Languages and Literatures"},{"course_num":"752","approval_date":"5/4/06","description":"and Nineteenth-Century Latin American Literature. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption.","text":"AII.5B.11 Hispanic Languages and Literatures (G06-16, approved by Academic Senate 5/4/06)\nSpanish 752: Eighteenth\nand Nineteenth-Century Latin American Literature. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption.\nA survey of Latin American literature from the eighteenth and nineteenth centuries.  Some of the writers to be studied are: Andrés Bello, Domingo Faustino Sarmiento, and Gertrudis Gómez de Avellaneda. The course will cover a variety of topics, including: recreating Neoclassicism, Romanticism and Realism in the New World; emerging voices of the Criollos; and colonialism, nationalisms and independence.\nRationale: A course on Latin American literature from the eighteenth and nineteenth centuries is essential to examine the transition from Colonial literature to Latin American literature, as we know it today. Studying the complex processes of cultural autonomy undergone by Criollo writers is necessary to better understand Latin American literature of those two centuries, and to appreciate the originality and impact of Modernista literature at the turn of the nineteenth century.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"A course on Latin American literature from the eighteenth and nineteenth centuries is essential to examine the transition from Colonial literature to Latin American literature, as we know it today. Studying the complex processes of cultural autonomy undergone by Criollo writers is necessary to better understand Latin American literature of those two centuries, and to appreciate the originality and impact of Modernista literature at the turn of the nineteenth century.","id":"11","title":"Eighteenth","disp":"Hispanic Languages and Literatures"},{"course_num":"","approval_date":"5/4/06","description":"This course spans the first six decades of the twentieth century.  It covers the works of major authors in their respective genres: the “isms” (Jorge Luis Borges and Vicente Huidobro), the various phases of Pablo Neruda’s trajectory, the re-emergence of feminist poetry, the decline of gauchoesque drama (Florencio Sánchez, Samuel Eichelbaum) leading to “reflexive” theatre.  Other aspects covered are the novelists’ reinterpretation of indigenous Latin American cultures (Alejo Carpentier, Carlos Fuentes), and the surge of the “Boom” (Julio Cortázar, Gabriel García Márquez, etc.).","text":"AII.5B.12 Hispanic Languages and Literatures (G06-18, approved by Academic Senate 5/4/06)\nSpanish 756: From The Avant-Garde to the Postmodern. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThis course spans the first six decades of the twentieth century.  It covers the works of major authors in their respective genres: the “isms” (Jorge Luis Borges and Vicente Huidobro), the various phases of Pablo Neruda’s trajectory, the re-emergence of feminist poetry, the decline of gauchoesque drama (Florencio Sánchez, Samuel Eichelbaum) leading to “reflexive” theatre.  Other aspects covered are the novelists’ reinterpretation of indigenous Latin American cultures (Alejo Carpentier, Carlos Fuentes), and the surge of the “Boom” (Julio Cortázar, Gabriel García Márquez, etc.).\nRationale: In analyzing the literature of this period, students will learn to appreciate the originality of those writers who created new trends that influenced future generations.  They will also make connections between the writers and the socio-historical background of their respective countries.  Students’ oral reports, emphasizing critical interpretation, will be included in each class.\nProjected Enrollment: 15 students\nProjected Frequency: Every 3 semesters","justification":"In analyzing the literature of this period, students will learn to appreciate the originality of those writers who created new trends that influenced future generations.  They will also make connections between the writers and the socio-historical background of their respective countries.  Students’ oral reports, emphasizing critical interpretation, will be included in each class.","id":"12","title":"2 hr","disp":"Hispanic Languages and Literatures"},{"course_num":"","approval_date":"5/4/06","description":"This course explores the works of the latest writers up to the present. It follows the evolution of the concepts and techniques of the “post-boom”, the “post-modern” and the “novísma Iiteratura.” The course follows the changes in the literary trajectory of long-standing, acclaimed authors, as well as the ruptures that produced new alternatives: the writings of exile, testimonials, ethnic regionalism, journalistic fiction, detectivesque and cinematic narratives.","text":"AII.5B.13 Hispanic Languages and Literatures (G06-19, approved by Academic Senate 5/4/06)\nSpanish 758: Latin American Literature into the Twenty-First Century. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption. \nThis course explores the works of the latest writers up to the present. It follows the evolution of the concepts and techniques of the “post-boom”, the “post-modern” and the “novísma Iiteratura.” The course follows the changes in the literary trajectory of long-standing, acclaimed authors, as well as the ruptures that produced new alternatives: the writings of exile, testimonials, ethnic regionalism, journalistic fiction, detectivesque and cinematic narratives.\nRationale: Since most Spanish courses are dedicated to teaching canonical texts, it is very important to balance the curriculum by offering a course on the most current trends in Latin American literature. This course is essential to keep the students up-to-date with the literary production of the younger generations of Spanish American writers. Such a course will also be beneficial for those students who will work towards a Ph. D. in Spanish language and literature.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"Since most Spanish courses are dedicated to teaching canonical texts, it is very important to balance the curriculum by offering a course on the most current trends in Latin American literature. This course is essential to keep the students up-to-date with the literary production of the younger generations of Spanish American writers. Such a course will also be beneficial for those students who will work towards a Ph. D. in Spanish language and literature.","id":"13","title":"2 hr","disp":"Hispanic Languages and Literatures"},{"course_num":"760","approval_date":"5/4/06","description":"Projected Enrollment: 15","prereq":"colonialism and national identities; racism, poverty, and socio-political repression as causes of exile.","text":"AII.5B.14 Hispanic Languages and Literatures (G06-20, approved by Academic Senate 5/4/06)\nSpanish 760: Literature of the Hispanic Caribbean. 2 hr. plus conf.; 3 cr.\nPrereq.: Spanish 700 or exemption. A survey of the literature of the Hispanic Caribbean from the nineteenth century to the present. The reading list will include texts by renowned writers such as José Martí, Salomé Ureña de Henríquez, Eugenio María de Hostos, Julia de Burgos, Nicolás Guillén and Juan Bosch.  Some of the themes to be explored are: colonialism and national identities; racism, poverty, and socio-political repression as causes of exile.\nRationale: Given the nature of our student body, which includes a significant percentage of Cuban, Puerto Rican, and Dominican students, teaching a course on the literature of the Hispanic Caribbean is undoubtedly necessary to cater to their specific interests.  In addition, in the last decades the literature of the Hispanic Caribbean has become increasingly popular, not only in the United States, but also in many foreign countries.  Thus, to keep up with this international trend, it is imperative to offer such a course at Queens College. \nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"Given the nature of our student body, which includes a significant percentage of Cuban, Puerto Rican, and Dominican students, teaching a course on the literature of the Hispanic Caribbean is undoubtedly necessary to cater to their specific interests.  In addition, in the last decades the literature of the Hispanic Caribbean has become increasingly popular, not only in the United States, but also in many foreign countries.  Thus, to keep up with this international trend, it is imperative to offer such a course at Queens College. ","id":"14","title":"Literature of the Hispanic Caribbean","disp":"Hispanic Languages and Literatures"},{"course_num":"","approval_date":"5/4/06","description":"Projected Enrollment: 15","prereq":"To be taken in the first year of graduate study. The course will provide a brief overview of traditional approaches to key Hispanic texts, introduce students to the main tenets of contemporary theory (cultural studies, postcolonialism, New Historicism, materialism, gender studies, postmodernism, periodization, narratology, psychological approaches, post-structuralism, etc.), and apply those concepts through analysis of critical articles about Hispanic texts.","text":"AII.5B.15 Hispanic Languages and Literatures (G06-21, approved by Academic Senate 5/4/06)\nSpanish 770: Introduction to Literary and Cultural Theories, 2 hr. plus conf.; 3 cr.\nPrereq.: To be taken in the first year of graduate study. The course will provide a brief overview of traditional approaches to key Hispanic texts, introduce students to the main tenets of contemporary theory (cultural studies, postcolonialism, New Historicism, materialism, gender studies, postmodernism, periodization, narratology, psychological approaches, post-structuralism, etc.), and apply those concepts through analysis of critical articles about Hispanic texts.\nRationale: A course that introduces students to key literary and cultural theories is an integral component of graduate study in the humanities. Literary theory has previously been taught as part of Spanish 781: Methods of Research. In light of the proliferation of literary and cultural theories over the last two decades, this topic merits a class of its own.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"Methods of Research. In light of the proliferation of literary and cultural theories over the last two decades, this topic merits a class of its own.","id":"15","title":"2 hr","disp":"Hispanic Languages and Literatures"},{"course_num":"772","approval_date":"5/4/06","description":"Projected Enrollment: 20","prereq":"Spanish 700. This course is designed to analyze the struggle for equality and just representation carried on by Spaniards under despotic rule from 1898 until the end of the Franco era in 1975, and on to the period of Transition to Democracy.  Outstanding works of Spanish intellectuals of the various periods will be used to illustrate the struggle of the nation to keep pace with the rest of Europe and the world. Examples from literature, philosophy, education, politics, religion, and journalism may be used.","text":"AII.5B.16 Hispanic Languages and Literatures (G06-22, approved by Academic Senate 5/4/06)\nSpanish 772: Peninsular Spanish Culture and Thought. 2 hr. plus conf.; 3 cr.\nPrereq.: Spanish 700. This course is designed to analyze the struggle for equality and just representation carried on by Spaniards under despotic rule from 1898 until the end of the Franco era in 1975, and on to the period of Transition to Democracy.  Outstanding works of Spanish intellectuals of the various periods will be used to illustrate the struggle of the nation to keep pace with the rest of Europe and the world. Examples from literature, philosophy, education, politics, religion, and journalism may be used.\nRationale: This course takes a multi-disciplinary approach to the subject matter in refusing to privilege a single form of expression, be it artistic or otherwise, and looks at how a plurality of voices intervene in the struggles that comprised twentieth-century Spanish history.\nProjected Enrollment: 20\nProjected Frequency: Every 3 semesters","justification":"This course takes a multi-disciplinary approach to the subject matter in refusing to privilege a single form of expression, be it artistic or otherwise, and looks at how a plurality of voices intervene in the struggles that comprised twentieth-century Spanish history.","id":"16","title":"Peninsular Spanish Culture and Thought","disp":"Hispanic Languages and Literatures"},{"course_num":"774","approval_date":"5/4/06","description":"Projected Enrollment: 25","prereq":"Spanish 700 or exemption. The course will provide an overview of the main topics and trends in the development of Latin American culture, civilization and thought.  It will take into account the fundamental structures of pre-conquest society, the establishment of colonial domination and the transition to forms of neocolonialism, the formation of hybrid cultures and ethnicities, and the socio-cultural profile of contemporary urban life. ","text":"AII.5B.17 Hispanic Languages and Literatures (G06-23, approved by Academic Senate 5/4/06)\nSpanish 774: Latin American Culture and Thought. 2 hr. plus conf.; 3 cr.\nPrereq.: Spanish 700 or exemption. The course will provide an overview of the main topics and trends in the development of Latin American culture, civilization and thought.  It will take into account the fundamental structures of pre-conquest society, the establishment of colonial domination and the transition to forms of neocolonialism, the formation of hybrid cultures and ethnicities, and the socio-cultural profile of contemporary urban life. \nRationale: An understanding of the salient aspects of Latin American culture and ideologies is indispensable for graduate students planning research in Hispanic literatures as well as for secondary school teachers who prepare units on the cultures of Spanish-speaking America.  Students will become familiar with major primary and secondary sources useful for research purposes and for the preparation of teaching materials.\nProjected Enrollment: 25\nProjected Frequency: Every 3 semesters","justification":"An understanding of the salient aspects of Latin American culture and ideologies is indispensable for graduate students planning research in Hispanic literatures as well as for secondary school teachers who prepare units on the cultures of Spanish-speaking America.  Students will become familiar with major primary and secondary sources useful for research purposes and for the preparation of teaching materials.","id":"17","title":"Latin American Culture and Thought","disp":"Hispanic Languages and Literatures"},{"course_num":"","approval_date":"5/4/06","description":"An overview of the culture and literary production of Latinos/-as in New York. The course will focus on works of fiction written by authors from diverse ethnic, racial and socioeconomic backgrounds, and who have roots in several Latin American countries such as Puerto Rico, the Dominican Republic and Colombia. Some of the topics to be explored are: bilingualism and multiculturalism; immigration and the redefinition of national identity; preserving Hispanic culture vs. assimilating to the “American way of life”, etc.","prereq":"Spanish 700 or exemption","text":"AII.5B.18 Hispanic Languages and Literatures (G06-24, approved by Academic Senate 5/4/06)\nSpanish 776: Latino/Latina Writers in the United States. 2 hr. plus conf.; 3 cr.\nPrereq.: Spanish 700 or exemption\nAn overview of the culture and literary production of Latinos/-as in New York. The course will focus on works of fiction written by authors from diverse ethnic, racial and socioeconomic backgrounds, and who have roots in several Latin American countries such as Puerto Rico, the Dominican Republic and Colombia. Some of the topics to be explored are: bilingualism and multiculturalism; immigration and the redefinition of national identity; preserving Hispanic culture vs. assimilating to the “American way of life”, etc.\nRationale: A course specifically designed for the study of Latino culture and literature is essential in an institution like Queens College, whose diverse student body requires a serious commitment to multiculturalism. It is essential to understand and validate the complex experience of millions of Latinos and Latinas who have been an integral part of American society for more than a century. The course aims at promoting awareness and sensitivity among the student population, particularly among non-Hispanics.\nProjected Enrollment: 15\nProjected Frequency: Every 3 semesters","justification":"A course specifically designed for the study of Latino culture and literature is essential in an institution like Queens College, whose diverse student body requires a serious commitment to multiculturalism. It is essential to understand and validate the complex experience of millions of Latinos and Latinas who have been an integral part of American society for more than a century. The course aims at promoting awareness and sensitivity among the student population, particularly among non-Hispanics.","id":"18","title":"2 hr","disp":"Hispanic Languages and Literatures"},{"course_num":"","approval_date":"5/4/06","description":"This course focuses on the research conducted on regional aspects of Spanish in the United States from a variety of perspectives, and on the outlook for the growing population of Spanish speakers in many areas of the United States, particularly in bilingual education and other public policy questions.  ","text":"AII.5B.19 Hispanic Languages and Literatures (G06-27, approved by Academic Senate 5/4/06)\nSpanish 785. Research Seminar: Hispanic Linguistics. 2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption, plus 9 hours of graduate course work, including Spanish 770, and 2 linguistics and/or literature courses. Students can only take this seminar twice, provided that the topics are different.\nThis course focuses on the research conducted on regional aspects of Spanish in the United States from a variety of perspectives, and on the outlook for the growing population of Spanish speakers in many areas of the United States, particularly in bilingual education and other public policy questions.  \nRationale: This seminar is part of a series of courses in Hispanic Linguistics that have been added to our previous graduate curriculum to provide essential preparation in  Linguistics.  It will enrich the Hispanic Languages and Literatures curriculum by giving our graduate students in the Ms. in Ed. program in Education/Spanish an opportunity to conduct research in Hispanic Linguistics.  This knowledge will be valuable in their careers as teachers of Spanish and in future research.\nProjected Enrollment: 15\nProjected Frequency: Every 2 semesters","justification":"This seminar is part of a series of courses in Hispanic Linguistics that have been added to our previous graduate curriculum to provide essential preparation in  Linguistics.  It will enrich the Hispanic Languages and Literatures curriculum by giving our graduate students in the Ms. in Ed. program in Education/Spanish an opportunity to conduct research in Hispanic Linguistics.  This knowledge will be valuable in their careers as teachers of Spanish and in future research.","id":"19","title":"Hispanic Linguistics","disp":"Hispanic Languages and Literatures"},{"course_num":"","approval_date":"5/4/06","description":"2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption, plus 9 hours of graduate course work, including Spanish 770, and 2 linguistics and/or literature courses. Students can only take this seminar twice, provided that the topics are different.","text":"AII.5B.20 Hispanic Languages and Literatures (G06-28, approved by Academic Senate 5/4/06)\nSpanish 786. Research Seminar: Hispanic Literature.\n2 hr. plus conf.; 3 cr. Prereq.: Spanish 700 or exemption, plus 9 hours of graduate course work, including Spanish 770, and 2 linguistics and/or literature courses. Students can only take this seminar twice, provided that the topics are different.\nA series of courses devoted to the study of literature and culture with perspectives that cut across the conventional genre/period/geographic divides.  These courses will include, for example, interdisciplinary, comparative, interatlantic approaches to Hispanic literatures, or track a genre across history, or deal with unconventional topics in literature, or be devoted entirely to the study of one author from different perspectives. \nRationale: Our program is in need of a new course that permits study of literary texts from across the Hispanic world, bridging eras, genres, disciplines, or incorporating emerging theoretical approaches to texts.\nProjected Enrollment: 15\nProjected Frequency: Every 2 semesters","justification":"Our program is in need of a new course that permits study of literary texts from across the Hispanic world, bridging eras, genres, disciplines, or incorporating emerging theoretical approaches to texts.","id":"20","title":"Hispanic Literature","disp":"Hispanic Languages and Literatures"},{"course_num":"","hours":"3","credits":"3","text":"AII.5B.21 The Aaron Copland School of Music (G06-38, approved by Academic Senate 5/4/06)\nMUS 645. Seminar in Teaching Music: Elementary. 3 hr.; 3 cr. Prereq.: Co-req.: EECE 711.Students will focus on curriculum, instruction and assessment for teaching elementary classroom music. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies and technologies for supporting student learning as defined by city, state and national standards for music education. Strategies for adapting instruction to students with specific types of exceptionalities will be explored. There is an intensive field component  to this class that allows students the opportunity to teach and then reflect on their experiences with children. Biweekly observations are also required. Students must pass this course with a B or higher to continue on to MUS 646.\nProjected Enrollment: 15\nProjected Frequency: Once a year.","title":"Elementary","approval_date":"5/4/06","id":"21","description":"Projected Enrollment: 15","disp":"The Aaron Copland School of Music"},{"course_num":"","hours":"3","credits":"3","approval_date":"5/4/06","description":"Students will focus on curriculum, instruction and assessment for teaching secondary general music including music in middle schools. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies for supporting student learning as defined by city, state and national standards for music education. Students will learn and practice strategies for teaching music from a multicultural perspective. There is an intensive field component to this class that allows students the opportunity to teach and then reflect on their experiences with children. Weekly observations are also required. Students must pass this course with a B or higher to be allowed to student teach.","text":"AII.5B.22 The Aaron Copland School of Music (G06-38, approved by Academic Senate 5/4/06)\nMUS 646. Seminar in Teaching Music: Secondary. 3 hr.; 3 cr. Prereq.: MUS 645 with a minimum grade of B.  Co-req.: SEYS 552.\nStudents will focus on curriculum, instruction and assessment for teaching secondary general music including music in middle schools. Students will learn about children’s musical thinking from a developmental point of view. Students will learn and practice teaching strategies for supporting student learning as defined by city, state and national standards for music education. Students will learn and practice strategies for teaching music from a multicultural perspective. There is an intensive field component to this class that allows students the opportunity to teach and then reflect on their experiences with children. Weekly observations are also required. Students must pass this course with a B or higher to be allowed to student teach.\nProjected Enrollment: 15\nProjected Frequency: Once a year.\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program.): ","justification":"The two courses listed above must be considered as a package. They are intended to replace the existing single course MUS 643 – Seminar in Teaching Music. 4 hr.; 4cr. This course (MUS 643)  meets twice a week (2 hrs. each day) and is taught by two faculty – one an elementary specialist, the other a secondary specialist. With the recent increased requirements of the New York State Education Department in the areas of technology, special learners and multiculturalism, the faculty teaching this course currently feel that the combined four hours a week is insufficient time to cover these topics adequately. We feel that the educational/pedagogical advantages more than justify the additional two hours and two credits as this is the final program phase before student teaching. The existing course (MUS 643) will be phased out after the Fall, 2006 semester. It should be noted that the courses under consideration here are to be part of the Advanced Certificate Program, and are not part of the MS:Ed in Music degree.","id":"22","title":"Secondary","disp":"The Aaron Copland School of Music"},{"course_num":"","hours":"3","credits":"3","approval_date":"5/4/06","description":"This course will cover various clinical topics such as suicide assessment, crisis intervention, critical incident counseling, and grief &amp; trauma issues as well as mental health and substance abuse assessment.  Ethical codes for professional counselors will be reviewed and ethical issues will be addressed. Taken as a pre-requisite or co-requisite with counseling practicum ECPCE 729 or 721.           ","text":"AII.5B.23 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 708.  Ethics, Clinical Issues, and Crisis Intervention. 3 hr.; 3 cr. \nThis course will cover various clinical topics such as suicide assessment, crisis intervention, critical incident counseling, and grief &amp; trauma issues as well as mental health and substance abuse assessment.  Ethical codes for professional counselors will be reviewed and ethical issues will be addressed. Taken as a pre-requisite or co-requisite with counseling practicum ECPCE 729 or 721.           \nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program): \nProjected enrollment:  30\nProjected frequency: 1 time per year (Fall)","justification":"The Council for the Accreditation of Counseling and Related Programs (CACREP) which is the national standard for counselor education programs and the model for most state certifications, requires ethics as part of every counseling program.  This course covers ethics and the topic is explicitly noted in the title and course description which makes it easier for accrediting agencies to identify this component of the training program.  In addition, the course covers important areas such as suicide assessment and crisis interventions which are critical skills for every counselor.  The course was created to ensure that every counseling student is exposed to these skills in a standard and formalized way.  In requiring the course as a pre-requisite or co-requisite for Counseling Practicum (the students’ first field experience with real clients), the program better prepares the practicum students in the event that they encounter a crisis with a client at their field site.  This course will be required for both school and mental health counseling students.     ","id":"23","title":"and Crisis Intervention","disp":"Educational and Community Programs"},{"course_num":"808","hours":"3","credits":"3","approval_date":"5/4/06","description":"This course will focus on the methods, techniques and issues of counseling children and adolescents.  General considerations of developmental stages, family dynamics, school environment and the therapeutic relationship will be discussed. The etiology and assessment of common childhood disorders and empirically supported treatment will be reviewed.  Cognitive-behavioral, pharmacological, educational, and ecological interventions will be addressed as well as issues of prevention and community resources","text":"AII.5B.24 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 808. Child and Adolescent Counseling. 3hr.; 3 cr. Prereq.: ECPCE 702 Theories of Human Development or equivalent. \nThis course will focus on the methods, techniques and issues of counseling children and adolescents.  General considerations of developmental stages, family dynamics, school environment and the therapeutic relationship will be discussed. The etiology and assessment of common childhood disorders and empirically supported treatment will be reviewed.  Cognitive-behavioral, pharmacological, educational, and ecological interventions will be addressed as well as issues of prevention and community resources\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program):    This course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790. The emphasis on counseling  children and adolescents is essential for all school counselors as well as for mental health counselors specializing in youth.  The creation of this course with a new and permanent number allows it to be offered regularly and to be required by school counseling students.  It is also easier for accrediting agencies (such as the state education dept) to identify this course since the variable title courses appear on the students’ transcripts with generic titles that are confusing to others. \nProjected enrollment:  25\nProjected frequency:  1 time per year","justification":"This course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790. The emphasis on counseling  children and adolescents is essential for all school counselors as well as for mental health counselors specializing in youth.  The creation of this course with a new and permanent number allows it to be offered regularly and to be required by school counseling students.  It is also easier for accrediting agencies (such as the state education dept) to identify this course since the variable title courses appear on the students’ transcripts with generic titles that are confusing to others. ","id":"24","title":"Child and Adolescent Counseling","disp":"Educational and Community Programs"},{"course_num":"","approval_date":"5/4/06","description":"This course will cover major theories of learning and motivation as they apply to school counseling settings.  Principles of attribution, self-efficacy, goal setting, conditioning and information processing will be applied to student achievement and academic development as well as to the counseling experience as a type of learning process.  Emphasis will be placed on the role of the counselor as a consultant to teachers, in support services for students with learning and motivation difficulties, and in psychoeducational and ecological interventions.  The course is designed for the graduate students to experience their own learning and motivational processes.","text":"AII.5B.25 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 809 Learning and Motivation in School Counseling. 3 hr.;. 3 cr.\nThis course will cover major theories of learning and motivation as they apply to school counseling settings.  Principles of attribution, self-efficacy, goal setting, conditioning and information processing will be applied to student achievement and academic development as well as to the counseling experience as a type of learning process.  Emphasis will be placed on the role of the counselor as a consultant to teachers, in support services for students with learning and motivation difficulties, and in psychoeducational and ecological interventions.  The course is designed for the graduate students to experience their own learning and motivational processes.\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program): This courses has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790. The emphasis on learning processes and motivation is essential for all school counselors as well as for mental health counselors specializing in youth.  The creation of this course with a new and permanent number allows it to be offered regularly.  It is also easier for accrediting agencies (such as the state education dept) to identify this course since the variable title courses appear on the students’ transcripts with generic titles that are confusing to others. \nProjected enrollment:  15-20\nProjected frequency: 1 time per year","justification":"This courses has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790. The emphasis on learning processes and motivation is essential for all school counselors as well as for mental health counselors specializing in youth.  The creation of this course with a new and permanent number allows it to be offered regularly.  It is also easier for accrediting agencies (such as the state education dept) to identify this course since the variable title courses appear on the students’ transcripts with generic titles that are confusing to others. ","id":"25","title":"3 hr","disp":"Educational and Community Programs"},{"course_num":"","approval_date":"5/4/06","description":"This foundation course surveys the role of mental health counselors on the state and national level.  Topics will include requirements for licensing, history of the discipline, supervision, consultation, community issues, prevention, and legal/ethical issues. This course is required for students in the mental health program.","text":"AII.5B.26 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 811 Mental Health Counseling. 3 hr.; 3 cr.\nThis foundation course surveys the role of mental health counselors on the state and national level.  Topics will include requirements for licensing, history of the discipline, supervision, consultation, community issues, prevention, and legal/ethical issues. This course is required for students in the mental health program.\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program):   In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health curriculum.  The state education department requires a course that covers foundations of mental health.  The proposed course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program.  The new title and number will clearly identify the course as fulfilling the foundations requirement for the state and remove the confusion that has occurred with the generic title of the variable title courses.      \nProjected enrollment: 15 - 20\nProjected frequency:  1 time per year ","justification":"In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health curriculum.  The state education department requires a course that covers foundations of mental health.  The proposed course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program.  The new title and number will clearly identify the course as fulfilling the foundations requirement for the state and remove the confusion that has occurred with the generic title of the variable title courses.      ","id":"26","title":"3 hr","disp":"Educational and Community Programs"},{"course_num":"","approval_date":"5/4/06","description":"This course covers the DSM classification system of mental disorders and focuses on the etiology, developmental pathways, assessment and treatment of various psychopathologies.  Psychopharmacology and other treatment approaches will be addressed as well as the role of the mental health counselor.  This course is required for the Mental Health program","text":"AII.5B.27 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 812 Psychopathology &amp; Diagnosis in Mental Health Counseling. 3 hr.; 3 cr. \nThis course covers the DSM classification system of mental disorders and focuses on the etiology, developmental pathways, assessment and treatment of various psychopathologies.  Psychopharmacology and other treatment approaches will be addressed as well as the role of the mental health counselor.  This course is required for the Mental Health program\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program):  In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health program.  The state education department requires a course that covers psychopathology and DSM diagnosis.  This course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program.  The new title and number will clearly identify the course as fulfilling the requirement for the state and remove the confusion that has occurred with the generic title of the variable title courses.      \nProjected enrollment: 15 - 20\nProjected frequency: 1 time per year","justification":"In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health program.  The state education department requires a course that covers psychopathology and DSM diagnosis.  This course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program.  The new title and number will clearly identify the course as fulfilling the requirement for the state and remove the confusion that has occurred with the generic title of the variable title courses.      ","id":"27","title":"3 hr","disp":"Educational and Community Programs"},{"course_num":"","approval_date":"5/4/06","description":"In this course the main stages of the family life cycle are studied as a means of understanding the family as a system of human relationships. Developmental stages, family rituals, family crises, and other variables affecting family development are examined. The purpose of this course is to enable students to assess family systems, to develop knowledge of current family life demographics,and to gain an understanding of marriage and family styles, symptomatology, and counseling techniques..","text":"AII.5B.28 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 813 Family Dynamics. 3 hr.; 3 cr. \nIn this course the main stages of the family life cycle are studied as a means of understanding the family as a system of human relationships. Developmental stages, family rituals, family crises, and other variables affecting family development are examined. The purpose of this course is to enable students to assess family systems, to develop knowledge of current family life demographics,and to gain an understanding of marriage and family styles, symptomatology, and counseling techniques..\nRationale (Please include an explicit statement regarding how you expect this new course to fit into your graduate program):   In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health program.  The state education department requires a course that covers families.  Knowledge of this area is crucial for any professional working in the mental health field.  This course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program.  The new title and number will clearly identify the course as fulfilling the requirement for the state and remove the confusion that has occurred with the generic title of the variable title courses.      \nProjected enrollment: 20\nProjected frequency:  1 time per year","justification":"In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health program.  The state education department requires a course that covers families.  Knowledge of this area is crucial for any professional working in the mental health field.  This course has been offered several times over the past few years under the variable title department course number of ECP 818 or ECP 790.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program.  The new title and number will clearly identify the course as fulfilling the requirement for the state and remove the confusion that has occurred with the generic title of the variable title courses.      ","id":"28","title":"3 hr","disp":"Educational and Community Programs"},{"course_num":"","approval_date":"5/4/06","description":"This course entails an in-depth study of specific counseling approaches and their use with various client populations. Case studies will provide a focus for analysis.  Students are required to conduct literature reviews and to make presentations. ","text":"AII.5B.29 Educational and Community Programs (G06-41, approved by Academic Senate 5/4/06)\nECPCE 814 Seminar in Advanced Applications of Psychological Theories. 3 Credits; meeting 3 hours per week. Prereq.: ECPCE 700; ECPCE 704; ECPCE 703.\nThis course entails an in-depth study of specific counseling approaches and their use with various client populations. Case studies will provide a focus for analysis.  Students are required to conduct literature reviews and to make presentations. \nRationale: In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health curriculum. The proposed course has been offered several times over the past few years under the variable title department course number of ECP 818.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program and taken as an elective by those school counseling students who have an interest in more sophisticated counseling applications.  The new title and number will remove confusion that has occurred with the generic title of the variable title course.\nProjected enrollment: 20\nProjected frequency:  1 time per academic year.\nSECTION AIII AFFILIATION AGREEMENTS\nAIII – 5A.1\nAgreement with Metropolitan Jewish Geriatric Center\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Metropolitan Jewish Geriatric Center to enable students enrolled in the College's dietetic internship program in the Department of Family, Nutrition and Exercise Sciences to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Metropolitan Jewish Geriatric Center will fulfill the clinical training required for the dietetic internship program of the College’s Department of Family, Nutrition and Exercise Sciences.      \nAIII – 5A.2\nAgreement with the League for the Hard of Hearing\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with the League for the Hard of Hearing to enable students enrolled in the College's speech and hearing program in the Department of Linguistics and Communications Disorders to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at the League for the Hard of Hearing will fulfill the clinical training required for the speech and hearing program of the College’s Department of Linguistics and Communications Disorders.      \nAIII – 5A.3\nAgreement with St. Mary’s Hospital for Children\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with St. Mary’s Hospital for Children to enable students enrolled in the College's speech and hearing program in the Department of Linguistics and Communications Disorders to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at St. Mary’s Hospital for Children will fulfill the clinical training required for the speech and hearing program of the College’s Department of Linguistics and Communications Disorders.       \nAIII – 5A.4\nAgreement with Coney Island Hospital\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Coney Island Hospital to enable students enrolled in the College's M.A. program in clinical behavioral applications in the Department of Psychology to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Coney Island Hospital will fulfill the clinical training required for the M.A. program in clinical behavioral applications in the Department of Psychology.        \nAIII – 5A.5\nAgreement with Family Residences and Essential Enterprises, Inc. \nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Family Residences and Essential Enterprises, Inc. to enable students enrolled in the College's M.A. program in clinical behavioral applications in the Department of Psychology to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Family Residences and Essential Enterprises, Inc. will fulfill the clinical training required for the M.A. program in clinical behavioral applications in the Department of Psychology.  \nAIII – 5A.6\nAgreement with Board of Cooperative Educational Services\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with Board of Cooperative Educational Services to enable students enrolled in the College's psychology internship program in the Department of Educational and Community Programs to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at Board of Educational Services will fulfill the clinical training required for the psychology internship program of the College’s Department of Educational and Community Programs.       \nAIII – 5A.7\nAgreement with School for Language and Communication Development\nRESOLVED:  That the Board of Trustees of The City University of New York authorize the General Counsel to execute an affiliation agreement on behalf of Queens College with the School for Language and Communication Development to enable students enrolled in the College's speech and hearing program in the Department of Linguistics and Communications Disorders to obtain the appropriate clinical experience necessary for the completion of degree requirements.  Neither party to this agreement is obligated to pay any monetary consideration to the other.  The agreement is for a two year period and shall include up to two two-year options for the College to renew in its best interest.  The agreement shall be subject to approval as to form by the University Office of General Counsel.\nEXPLANATION:   Student experience at the School for Language and Communication Development will fulfill the clinical training required for the speech and hearing program of the College’s Department of Linguistics and Communications Disorders.       ","justification":"In response to the newly created licensing in mental health counseling in New York State, the Counseling Program is preparing for the anticipated increase of students taking the mental health curriculum. The proposed course has been offered several times over the past few years under the variable title department course number of ECP 818.  In creating a new and permanent course number it can be offered regularly and be required for students in the mental health program and taken as an elective by those school counseling students who have an interest in more sophisticated counseling applications.  The new title and number will remove confusion that has occurred with the generic title of the variable title course.","id":"29","title":"Prereq","disp":"Educational and Community Programs"}]