[{"course_num":"201","hours":"3","credits":"3","description":"Introduction to a broad range of leadership topics from self-development and understanding self, to group behavior, organizational design, ethics and teamwork.  The course will focus on increasing students’ knowledge and understanding of leadership design and theory, as well as prepare students to become effective leaders. No previous leadership experience/knowledge is required.","prereq":"English 110.","text":"AIV.1   Student Personnel (07-08 approved by Senate 9/20/07)\nSTPE 201. Fundamentals of Leadership:  Yourself, Your Organizations and Your Communities\n3 Hours, 3 Credits.  Prerequisite:  English 110.\nPrerequisite:  English 110.\nIntroduction to a broad range of leadership topics from self-development and understanding self, to group behavior, organizational design, ethics and teamwork.  The course will focus on increasing students’ knowledge and understanding of leadership design and theory, as well as prepare students to become effective leaders. No previous leadership experience/knowledge is required.\nJustification: Central to the Queen College educational experience is preparing students to serve others.  This is accomplished by linking theory to practice in the various disciplines throughout the College.  The Student Personnel Program combines the pedagogy of service learning, with the practical application of developing strong leaders committed to serving their community.  This course, in conjunction with the Peer Counselor program and other leadership initiatives (including the CUNY Leadership Academy), hopes to achieve this goal.  \nThe course is open to all students, but specifically targets students who are part of the Peer Counselor program, and/or are current or emerging student leaders. ","justification":"Central to the Queen College educational experience is preparing students to serve others.  This is accomplished by linking theory to practice in the various disciplines throughout the College.  The Student Personnel Program combines the pedagogy of service learning, with the practical application of developing strong leaders committed to serving their community.  This course, in conjunction with the Peer Counselor program and other leadership initiatives (including the CUNY Leadership Academy), hopes to achieve this goal.  ","title":"Fundamentals of Leadership"},{"course_num":"239","hours":"3","credits":"3","justification":"An understanding of work and worker organizations is central to understanding the operation of modern urban society, especially in a city like New York where labor unions are an important social, economic, and political force.","text":"AIV.2   Urban Studies (07-12 approved by Senate 9/20/07)\nUBST 239. Urban Labor and Labor Movements. \n3 hr.; 3 cr. \nIntroduction to the nature of work and work organization in contemporary urban settings. Topics include the social organization of work, changes in the composition of the work force, the impact of technology on work and workers, and the organization of workers through labor unions and other forms of worker organization. The evolution of work and worker organization from the beginning of industrialization through the shift to a service-oriented economy will be central focus of the course.\nJustification: An understanding of work and worker organizations is central to understanding the operation of modern urban society, especially in a city like New York where labor unions are an important social, economic, and political force.","title":"Urban Labor and Labor Movements","description":"Introduction to the nature of work and work organization in contemporary urban settings. Topics include the social organization of work, changes in the composition of the work force, the impact of technology on work and workers, and the organization of workers through labor unions and other forms of worker organization. The evolution of work and worker organization from the beginning of industrialization through the shift to a service-oriented economy will be central focus of the course."},{"course_num":"260","hours":"3","credits":"3","description":"How the sensory systems code and perceive environmental stimuli. Topics include the visual system, the auditory/vestibular systems, speech perception, the cutaneous senses, and the chemical senses. Similarities and differences across the systems are highlighted and discussed, especially in terms of how stimuli for each sense are transduced into neuronal signals and how areas in the brain are specifically organized to receive and process these signals. Discussion of this conversion of sensory information to sensory perception is complemented throughout the course by examination of research using multiple techniques such as psychophysics, physiological recording, and brain imaging. ","prereq":"PSY 101. ","text":"AIV.3   Psychology (07-14, approved by Senate 9/20/07)\nPSY 260. Sensation and Perception. \n3 hr.; 3 cr. Prereq.: PSY 101. \nPrereq.: PSY 101. \nHow the sensory systems code and perceive environmental stimuli. Topics include the visual system, the auditory/vestibular systems, speech perception, the cutaneous senses, and the chemical senses. Similarities and differences across the systems are highlighted and discussed, especially in terms of how stimuli for each sense are transduced into neuronal signals and how areas in the brain are specifically organized to receive and process these signals. Discussion of this conversion of sensory information to sensory perception is complemented throughout the course by examination of research using multiple techniques such as psychophysics, physiological recording, and brain imaging. \nJustification: This course extends the range of our course offerings at the 200 level by providing an introduction to sensory psychology. The course has been taught successfully (Fall ’06) under our generic course number PSY281.","justification":"This course extends the range of our course offerings at the 200 level by providing an introduction to sensory psychology. The course has been taught successfully (Fall ’06) under our generic course number PSY281.","title":"Sensation and Perception"},{"course_num":"","hours":"3","credits":"3","description":"Approaches to infant/toddler care and education; instructional materials and techniques to foster infant/toddler development; strategies for administering and managing learning environments.","prereq":"admission to graduate program. ","text":"AIV.4 ,Elementary and Early Childhood Education (G07-23, approved by Senate 10/11/07)\nEECE 737: Infants and Toddlers: Curriculum and Teaching. \n3 hr.; 3 cr. Prereq.: admission to graduate program. \nPrereq.: admission to graduate program. \nApproaches to infant/toddler care and education; instructional materials and techniques to foster infant/toddler development; strategies for administering and managing learning environments.\nRationale:  Addition of the Infant Toddler course is to bring the program in line with the professional accreditation standards set forth by the National Association for the Education of Young Children and to insure that students have the appropriate experiences that are part of the Birth – Grade 2 State of New York Teacher Certification.  Prior to this, students had no courses or experiences with the Birth – age 3 populations that are expected for the Birth – Grade 2 certification.","justification":"Addition of the Infant Toddler course is to bring the program in line with the professional accreditation standards set forth by the National Association for the Education of Young Children and to insure that students have the appropriate experiences that are part of the Birth – Grade 2 State of New York Teacher Certification.  Prior to this, students had no courses or experiences with the Birth – age 3 populations that are expected for the Birth – Grade 2 certification.","title":"Curriculum and Teaching"}]