[{"course_num":"","justification":"History 143 (The History of the Indian Subcontinent ) is being withdrawn, and the material will be split into two courses, History 144 and 145. The history of the Asian Subcontinent is too long and complex to be adequately treated in one semester.","text":"AIV.1 History 144, (06-26, approved by Senate 11/9/06)\nCourse Number: History 144\nTitle:  Early South Asia\nHours: 3\nCredits: 3\nCourse Description: Origins of South Asian civilization from prehistory to the beginnings of colonial rule in the eighteenth century.  The development of religious systems like Hinduism and Buddhism, the arrival of Islam, the relations between different religious communities, and the creation of the first states and empires in South Asia.\nJustification:  History 143 (The History of the Indian Subcontinent ) is being withdrawn, and the material will be split into two courses, History 144 and 145. The history of the Asian Subcontinent is too long and complex to be adequately treated in one semester.","title":"Origins of South Asian civilization from prehistory to the beginnings of colonial rule in the eighteenth century","description":"Course Number: History 144"},{"course_num":"","justification":"History 143 (The History of the Indian Subcontinent ) is being withdrawn, and the material will be split into two courses, History 144 and 145. The history of the Asian Subcontinent is too long and complex to be adequately treated in one semester.","text":"AIV.2 History 145, (06-26, approved by Senate 11/9/06)\nCourse Number: History 145\nTitle:  Modern South Asia\nHours: 3\nCredits: 3\nCourse Description: History of the Indian subcontinent in the nineteenth and twentieth centuries.  The development of colonialism in India, anti-colonial movements, the partition of the subcontinent, the experience of women in colonial and post-colonial South Asia, the interplay between religion and national identity, and modern popular culture.\nJustification:  History 143 (The History of the Indian Subcontinent ) is being withdrawn, and the material will be split into two courses, History 144 and 145. The history of the Asian Subcontinent is too long and complex to be adequately treated in one semester.","title":"History of the Indian subcontinent in the nineteenth and twentieth centuries","description":"Course Number: History 145"},{"course_num":"","prereq":"6 credits in social sciences or in courses in the Department of Linguistics and Communication Disorders, or permission of instructor","justification":"To offer a course which combines analytical and research traditions from Anthropology and Linguistics which will focus on current language use and attitudes in New York and the U.S., and stress the development of skills in research design, analysis, and social scientific writing.  It will also add a U.S. area course to our curricula, ","text":"AIV.3 LCD288/ANTH 288, (06-19, approved by Senate 12/7/06)\nCourse Number: LCD288/ANTH 288\nTitle:  Voices of New York\nHours: 3\nCredits: 3\nPrerequisites:  6 credits in social sciences or in courses in the Department of Linguistics and Communication Disorders, or permission of instructor\nCourse Description: A research seminar using sociolinguistic and anthropological perspectives to explore current language use and attitudes in New York. Students will formulate research questions, and design and carry out original field research projects to answer these questions. \nJustification: To offer a course which combines analytical and research traditions from Anthropology and Linguistics which will focus on current language use and attitudes in New York and the U.S., and stress the development of skills in research design, analysis, and social scientific writing.  It will also add a U.S. area course to our curricula, ","title":"A research seminar using sociolinguistic and anthropological perspectives to explore current language use and attitudes in New York","description":"Course Number: LCD288/ANTH 288"}]