[{"course_num":"231","hours":"3","credits":"3","description":"This is a basic survey course on China’s economic development from a historical perspective. After a short review of some of China’s pre-1949 economic history, the course focuses on the People’s Republic, with roughly half the semester devoted to the period of Mao’s leadership (1949-1976) and the balance devoted to the post-Mao period of reform and transition to a market economy (1978–present).important issues ","prereq":"Math 131 and ECON101 or 103 and ECO102 or 104 and ENGL110.  ","text":"AIV.1 Economics (09-05, approved by Academic Senate 5/7/09)\nECO231. Economic Development of China. \n3 hr.; 3 cr. Prereq.: Math 131 and ECON101 or 103 and ECO102 or 104 and ENGL110.  \nPrereq.: Math 131 and ECON101 or 103 and ECO102 or 104 and ENGL110.  \nThis is a basic survey course on China’s economic development from a historical perspective. After a short review of some of China’s pre-1949 economic history, the course focuses on the People’s Republic, with roughly half the semester devoted to the period of Mao’s leadership (1949-1976) and the balance devoted to the post-Mao period of reform and transition to a market economy (1978–present).important issues \nJustification: This course will be of interest to many of our students given the dramatic economic changes in China in recent decades.","justification":"This course will be of interest to many of our students given the dramatic economic changes in China in recent decades.","title":"Economic Development of China"},{"course_num":"034","justification":"The College was invited to participate in the Howard Hughes Medical Institute’s groundbreaking Science Education Alliance (SEA). The goal of SEA is to create the opportunity to bring leading scientists and educators together to develop, implement, and/or disseminate vetted and novel methods, technologies, and practices that can broaden scientific understanding and participation. SEA's first undertaking will be a national experiment in both research and education that revolves around a research course in genomics for undergraduate students. Students with no background in biology will participate in an authentic research experience—integrated into a laboratory course designed for freshmen—that will result in a significant contribution to the broader genomics field. The long term goal is to enhance the teaching of science and inspire new generations of scientists and science-literate citizens. ","text":"AIV.2 Biology (09-06, approved by Academic Senate 5/7/09)\nBIOL 034. Genomics Research Experience I. \n3 Credits. OPEN to freshmen only. \nThe first part of a two-semester sequence (Biology 034 and 035) that will introduce students to the scientific method for designing procedures for investigating natural phenomena, collecting data, acquiring new knowledge, and correcting and integrating existing knowledge. Students with no background in biology will participate in an authentic research experience—integrated into a laboratory course designed for freshmen—that will result in a significant contribution to the understanding of microbial genomics. During the fall course, soil samples will be collected in the field. From these samples students will identify and purify bacteriophages (viruses that infect bacteria). The bacteriophages will be characterized structurally by electron microscopy, and their DNA will be purified and sequenced. (Fall)\nJustification: The College was invited to participate in the Howard Hughes Medical Institute’s groundbreaking Science Education Alliance (SEA). The goal of SEA is to create the opportunity to bring leading scientists and educators together to develop, implement, and/or disseminate vetted and novel methods, technologies, and practices that can broaden scientific understanding and participation. SEA's first undertaking will be a national experiment in both research and education that revolves around a research course in genomics for undergraduate students. Students with no background in biology will participate in an authentic research experience—integrated into a laboratory course designed for freshmen—that will result in a significant contribution to the broader genomics field. The long term goal is to enhance the teaching of science and inspire new generations of scientists and science-literate citizens. ","title":"Genomics Research Experience I","description":"3 Credits. OPEN to freshmen only. "},{"course_num":"035","justification":"The College was invited to participate in the Howard Hughes Medical Institute’s groundbreaking Science Education Alliance (SEA). The goal of SEA is to create the opportunity to bring leading scientists and educators together to develop, implement, and/or disseminate vetted and novel methods, technologies, and practices that can broaden scientific understanding and participation. SEA's first undertaking will be a national experiment in both research and education that revolves around a research course in genomics for undergraduate students. Students with no background in biology will participate in an authentic research experience—integrated into a laboratory course designed for freshmen—that will result in a significant contribution to the broader genomics field. The long term goal is to enhance the teaching of science and inspire new generations of scientists and science-literate citizens. ","text":"AIV.3 Biology (09-06, approved by Academic Senate 5/7/09)\nBIOL 035. Genomics Research Experience II\n3 credits. Prerequisite: BIOL 034\nThe second part of a two-semester sequence (Biology 034 and 035).  During the spring course, open only to those completing the fall course (BIOL 034), DNA sequences of phages obtained during the fall semester will be analyzed with bioinformatic tools and compared with those of phages isolated at other locations.  The goal is to identify genes and their organization, examine their similarities and differences that may characterize different phage groups, and determine how these groups may have arisen during evolution. (Spring)\nJustification: The College was invited to participate in the Howard Hughes Medical Institute’s groundbreaking Science Education Alliance (SEA). The goal of SEA is to create the opportunity to bring leading scientists and educators together to develop, implement, and/or disseminate vetted and novel methods, technologies, and practices that can broaden scientific understanding and participation. SEA's first undertaking will be a national experiment in both research and education that revolves around a research course in genomics for undergraduate students. Students with no background in biology will participate in an authentic research experience—integrated into a laboratory course designed for freshmen—that will result in a significant contribution to the broader genomics field. The long term goal is to enhance the teaching of science and inspire new generations of scientists and science-literate citizens. ","title":"Genomics Research Experience II","description":"3 credits. Prerequisite: BIOL 034"},{"course_num":"10","hours":"2","credits":"1","justification":"Teacher education programs in physical education are required by NASPE/NCATE, our accrediting organization, to demonstrate that our teacher candidates can “demonstrate personal competence in motor skill performance for a variety of activities and movement patterns.” For this reason we are removing swimming (FNES 15 which was previously a one credit-two hour course) as a required course and including it within the activities of the new course which will review and evaluate candidates on the skills and concepts of a variety of sports and activities and introduce them to assessment tools ((approved by the State Education Department) used in New York State high schools. We have developed this course in response to the NCATE requirement. This change will produce no change in credits to the major/program; rather it is substituting a generalized swimming requirement with more specific competency requirements in a variety of sports and activities required by NCATE. It gives us a better opportunity to assess and evaluate the skills levels of incoming majors, and suggest remediation where possible. This course will not replace any other activity course requirements since those are at an advanced level and have pedagogy components as part of their requirements which are not part of this course. ","text":"AIV.4 FNES (09-07, approved by Academic Senate 5/7/09)\nFNES 10. Introduction to Skill Assessment and Physical Education Standards. \n2 hr.; 1 cr.\nAssessment of teacher candidates’ skills and knowledge of concepts in a variety of sports and activities and provide an introduction to the Physical Education Profile, an assessment strategy used in high schools across New York State.\nJustification: Teacher education programs in physical education are required by NASPE/NCATE, our accrediting organization, to demonstrate that our teacher candidates can “demonstrate personal competence in motor skill performance for a variety of activities and movement patterns.” For this reason we are removing swimming (FNES 15 which was previously a one credit-two hour course) as a required course and including it within the activities of the new course which will review and evaluate candidates on the skills and concepts of a variety of sports and activities and introduce them to assessment tools ((approved by the State Education Department) used in New York State high schools. We have developed this course in response to the NCATE requirement. This change will produce no change in credits to the major/program; rather it is substituting a generalized swimming requirement with more specific competency requirements in a variety of sports and activities required by NCATE. It gives us a better opportunity to assess and evaluate the skills levels of incoming majors, and suggest remediation where possible. This course will not replace any other activity course requirements since those are at an advanced level and have pedagogy components as part of their requirements which are not part of this course. ","title":"Introduction to Skill Assessment and Physical Education Standards","description":"Assessment of teacher candidates’ skills and knowledge of concepts in a variety of sports and activities and provide an introduction to the Physical Education Profile, an assessment strategy used in high schools across New York State."},{"course_num":"222","hours":"3","credits":"3","description":"Geometric optics; periodic and non-periodic waves; Doppler effect; interference and diffraction, diffraction gratings; theory of polarization of light; fiber optics; introduction to lasers","prereq":"Physics 146 or 122 and Math 201. ","text":"AIV.5 Physics (08-28, approved by Academic Senate 10/15/09)\n222. Optics. \n3 hr.; 3 cr. Prereq.: Physics 146 or 122 and Math 201. \nPrereq.: Physics 146 or 122 and Math 201. \nGeometric optics; periodic and non-periodic waves; Doppler effect; interference and diffraction, diffraction gratings; theory of polarization of light; fiber optics; introduction to lasers\nJustification: ","justification":"In order to increase access to the course in optics to a greater number of students, including future teachers, we suggest downgrading our optic course from 300 level to 200 level with the appropriate changes in the topics and the degree of difficulty. ","title":"Optics"},{"course_num":"311","hours":"3","credits":"3","description":"Maxwell’s equations, propagation and radiation of electromagnetic waves; electromagnetic waves in conductors and dielectrics. Fall, Spring.","prereq":"Physics 310 ","text":"AIV.6 Physics (08-28, approved by Academic Senate 10/15/09)\n311. Electromagnetism 2. \n3 hr.; 3 cr. Prereq.: Physics 310 \nPrereq.: Physics 310 \nMaxwell’s equations, propagation and radiation of electromagnetic waves; electromagnetic waves in conductors and dielectrics. Fall, Spring.\nJustification: ","justification":"Recently a larger number of our students enroll in graduate programs in physics and related disciplines. In order to improve their readiness for these programs they need a more intensive exposure to classical electrodynamics. Therefore we suggest a new course, which would introduce the second semester of electrodynamics bring our program more in line with traditional undergraduate physics curricula accepted in most universities.","title":"Electromagnetism 2"},{"prereq":"Physics 122, or 146, Mathematics 201.","course_num":"233","hours":"1","credits":"1","justification":"The course is intended to prepare Physics-Science Education majors for taking upper level physics courses and will run for 3 hrs for the first 5 weeks of the semester along with Physics 233. It covers differential equations used in advanced physics courses.","text":"AIV.7 Physics (08-28, approved by Academic Senate 10/15/09)\n233.1. Intermediate Methods of Mathematical Physics for Physics-Science education majors \n1hr.; 1 cr. Prereq.: Physics 122, or 146, Mathematics 201.\nPrereq.: Physics 122, or 146, Mathematics 201.\nJustification:","title":"1"},{"course_num":"145","hours":"2","credits":"1","text":"AIV.8 Physics (08-28, approved by Academic Senate 10/15/09)\n145.1 Principles of Physics I Laboratory \n2hr.; 1 cr. Pre- or corequisite: PHYS 145.4.\nPre- or corequisite: PHYS 145.4.\nLaboratory component of the Principles of Physics I course. Includes experiments in the areas of mechanics and thermodynamics. Must be taken initially with Physics 145.4. May be taken alone if a passing grade has been received in Physics 145.4.","title":"1 Principles of Physics I Laboratory ","description":"Pre- or corequisite: PHYS 145.4."},{"course_num":"146","hours":"2","credits":"1","text":"AIV.9 Physics (08-28, approved by Academic Senate 10/15/09)\n146.1 Principles of Physics II Laboratory \n2hr.; 1 cr. Pre- or corequisite: PHYS 146.4.\nPre- or corequisite: PHYS 146.4.\nLaboratory component of the Principles of Physics II course. Includes experiments in the areas of optics and electromagnetism. Must be taken initially with Physics 146.4. May be taken alone if a passing grade has been received in Physics 146.4.","title":"1 Principles of Physics II Laboratory ","description":"Pre- or corequisite: PHYS 146.4."},{"course_num":"121","hours":"2","credits":"1","text":"AIV.10 Physics (08-28, approved by Academic Senate 10/15/09)\n121.1 General Physics I Laboratory \n2hr.; 1 cr. Pre- or corequisite: PHYS 121.4. \nPre- or corequisite: PHYS 121.4. \nLaboratory component of the General Physics I course. Includes experiments in the areas of mechanics and thermodynamics. Must be taken initially with Physics 121.4. May be taken alone if a passing grade has been received in Physics 121.4.","title":"1 General Physics I Laboratory ","description":"Pre- or corequisite: PHYS 121.4. "},{"course_num":"122","hours":"2","credits":"1","text":"AIV.11 Physics (08-28, approved by Academic Senate 10/15/09)\n122.1 General Physics II Laboratory \n2hr.; 1 cr. Pre- or corequisite: PHYS 122.4. \nPre- or corequisite: PHYS 122.4. \nLaboratory component of the General Physics II course. Includes experiments in the areas of optics and electromagnetism. Must be taken initially with Physics 122.4. May be taken alone if a passing grade has been received in Physics 122.4.","title":"1 General Physics II Laboratory ","description":"Pre- or corequisite: PHYS 122.4. "},{"course_num":"001","justification":"In order to place a greater emphasis on the overall experience of learning physics, students need to experience the nature of doing physics first hand in a laboratory setting. This setting should enable a student to be evaluated solely based on their lab work and not as a percentage of an overall grade that encompasses examinations and quizzes based on lecture/recitation aspect of the course. This goal is achievable by creating independent and dedicated laboratory courses for each of the introductory physics courses. ","text":"AIV.12 Physics (08-28, approved by Academic Senate 10/15/09)\n001.1 Conceptual Physics Laboratory \n2hs; 1 cr. Pre- or corequisite: PHYS 001.4. \nLaboratory component of the Conceptual Physics course. Includes experiments in the areas of optics and electromagnetism. Must be taken initially with Physics 001.4. May be taken alone if a passing grade has been received in Physics 001.4.\nJustification: In order to place a greater emphasis on the overall experience of learning physics, students need to experience the nature of doing physics first hand in a laboratory setting. This setting should enable a student to be evaluated solely based on their lab work and not as a percentage of an overall grade that encompasses examinations and quizzes based on lecture/recitation aspect of the course. This goal is achievable by creating independent and dedicated laboratory courses for each of the introductory physics courses. \nCreating such independent laboratory courses would benefit both the students and the department. Primarily, it will permit students to have a more flexible scheduling option, compared to the current combined comprehensive lecture/recitation and lab course. This flexibility will enable students to prepare adequately for their laboratory assignments and therefore result in a more meaningful laboratory experience overall. The ability to offer more independent laboratory sections on different days at various times will benefit the department by potentially increasing enrollment in all of the introductory physics courses. In addition, it will also alleviate scheduling complications and enable better grading criteria, both in the lecture/recitation and the laboratory component of any course. It is important to note that in order to receive credit for any given laboratory course the student must register and satisfactorily complete the appropriate/corresponding physics course and receive a passing grade. ","title":"1 Conceptual Physics Laboratory ","description":"2hs; 1 cr. Pre- or corequisite: PHYS 001.4. "},{"prereq":"English 110.","course_num":"2009","hours":"3","credits":"3","text":"AIV.13 Economics ( approved by Academic Senate 9/10/09)\n(Approved 4/2/2009, pending WISC approval)\nBusiness 160W- An Introduction to Business Writing\n3 hr; 3 cr. Prereq.: English 110.\nPrereq.: English 110.\nEmphasis on basic writing principles covering planning, analysis of audience and purpose, generating and organizing ideas, grammar, the use of drafts, and effective presentations with applications to the types of documents used by finance professionals. Specific topics include effective writing for resumes, letters, memos, and reports, as well as, guidelines for professional email correspondence. The final writing project requires an oral presentation.","title":"pending WISC approval","description":"Business 160W- An Introduction to Business Writing"},{"course_num":"","justification":"This is a core course run by the QC Center on Byzantine and Modern Greek Studies. It has been offered as an experimental course for a number of years. It aims to provide students with the opportunity to conduct learn research skills while conducting research on the Greek community in Queens.","text":"AIV.14 Urban Studies (09-10, approved by Academic Senate 9/10/09)\n(Approved 4/2/2009 pending WISC approval)\nURBST 340W. The Greek-American Community In New York\n3 hr.; 3 cr. Political, social, economic, educational and cultural attributes of the Greek-American community in the New York area, especially in Queens which includes Astoria, the largest “Greek Town” in America. The combination of lectures, research to be carried out by students including the development of a questionnaire, and writing of a term paper will enable them to have a good understanding of the Greek community and of the changing dynamics of the Greek community in Queens.\nJustification: This is a core course run by the QC Center on Byzantine and Modern Greek Studies. It has been offered as an experimental course for a number of years. It aims to provide students with the opportunity to conduct learn research skills while conducting research on the Greek community in Queens.","title":"and writing of a term paper will enable them to have a good understanding of the Greek community and of the changing dynamics of the Greek community in Queens","description":"(Approved 4/2/2009 pending WISC approval)"},{"course_num":"255","hours":"3","credits":"3","justification":"This is a core course run by the QC Center on Byzantine and Modern Greek Studies. It has been offered as an experimental course for a number of years. It provide students with an example of ethnic community politics in America by focusing on a key community in Queens.","text":"AIV.15 Urban Studies (09-10, approved by Academic Senate 9/10/09)\n(Approved 4/2/2009 pending approval of Political Science)\nURBST 255. Ethnic Community Politics in the US: The Case of Greek-Americans. \n3 hr., 3 cr. The role of ethnic communities in the American political process with a focus on the Greek-American community. The main objective of the course is to enable students to understand and analyze the political behavior of the Greek American community within the broader framework of American political dynamics, social and cultural changes and the emergence of the multicultural mosaic paradigm. The socio-cultural characteristics of this community will be examined as they evolved since the early 1900s along with its main institutions. The politicization of the community will be analyzed within the broader context of ethnic politics in America and with emphasis on the 1974 Cyprus crisis that became the catalyst for the formation of the “Greek lobby.”\nThe role of ethnic communities in the American political process with a focus on the Greek-American community. The main objective of the course is to enable students to understand and analyze the political behavior of the Greek American community within the broader framework of American political dynamics, social and cultural changes and the emergence of the multicultural mosaic paradigm. The socio-cultural characteristics of this community will be examined as they evolved since the early 1900s along with its main institutions. The politicization of the community will be analyzed within the broader context of ethnic politics in America and with emphasis on the 1974 Cyprus crisis that became the catalyst for the formation of the “Greek lobby.”\nJustification: This is a core course run by the QC Center on Byzantine and Modern Greek Studies. It has been offered as an experimental course for a number of years. It provide students with an example of ethnic community politics in America by focusing on a key community in Queens.","title":"Ethnic Community Politics in the US","description":"(Approved 4/2/2009 pending approval of Political Science)"},{"prereq":"Student must have been accepted into the Standard Music Major or the Music Major with the Music Education Sequence. ","course_num":"187","text":"AIV.16 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 187. Individual Study in Performance I. \n½ hour, 1 credit. \nPrerequisite: Student must have been accepted into the Standard Music Major or the Music Major with the Music Education Sequence. \nPrivate instruction in the student’s principal instrument or in voice. Students in the B.Mus. program (Performance Major) are not eligible for this sequence of courses and instead should take Music 151 (Major Study in Performance I) and its successor courses.","title":"Individual Study in Performance I","description":"½ hour, 1 credit. "},{"course_num":"188","text":"AIV.17 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 188. Individual Study in Performance II. \n½ hour, 1 credit. Prerequisite: MUSIC 187.","title":"Individual Study in Performance II","description":"½ hour, 1 credit. Prerequisite: MUSIC 187."},{"course_num":"287","text":"AIV.18 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 287. Individual Study in Performance III. \n½ hour, 1 credit. Prerequisite: MUSIC 188.","title":"Individual Study in Performance III","description":"½ hour, 1 credit. Prerequisite: MUSIC 188."},{"course_num":"288","text":"AIV.19 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 288. Individual Study in Performance IV. ½ hour, 1 credit. Prerequisite: MUSIC 287.","title":"Individual Study in Performance IV"},{"course_num":"387","text":"AIV.20 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 387. Individual Study in Performance V. ½ hour, 1 credit. Prerequisite: MUSIC 288.","title":"Individual Study in Performance V"},{"course_num":"388","justification":"we will offer Music 187 in Fall 2010; Music 187 and 188 in Spring 2011; the same plus Music 287 in Fall 2011; etc.","text":"AIV.21 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 388. Individual Study in Performance VI. ½ hour, 1 credit. Prerequisite: MUSIC 387.  May be repeated for credit up to 3 times (a total of 3 credits).\nJustification:  These six courses are being proposed as requirements for the B.A. in Music and the B.A. in Music with the Music Education sequence. Unlike most departments and schools of music throughout the United States, the Aaron Copland School of Music has never required nor, in most cases, offered individual instruction in performance to its liberal-arts music majors. This has placed our B.A. students at a serious disadvantage relative to students in B.A. music programs at, for example, the University of Rochester (River Campus), the University of Delaware, SUNY–Stony Brook, SUNY–Potsdam, SUNY–Fredonia, Hofstra, and Rutgers, not to mention prestigious schools such as Oberlin, Cornell, and Yale. We plan to launch the six courses one at a time: we will offer Music 187 in Fall 2010; Music 187 and 188 in Spring 2011; the same plus Music 287 in Fall 2011; etc.","title":"Individual Study in Performance VI"},{"course_num":"381","hours":"3","credits":"3","description":"Preparation for students to create original works and arrangements appropriate for elementary and secondary school vocal and instrumental ensembles. Principles of instrumentation, orchestration, arranging, and composition will be explored.","prereq":"MUSIC 274 or permission of instructor. ","text":"AIV.22 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 381. Arranging and Composing for School Ensembles. \n3 hours, 3 credits. Prerequisite: MUSIC 274 or permission of instructor. \nPrerequisite: MUSIC 274 or permission of instructor. \nPreparation for students to create original works and arrangements appropriate for elementary and secondary school vocal and instrumental ensembles. Principles of instrumentation, orchestration, arranging, and composition will be explored.\nJustification: The course is designed to teach practical skills that are frequently needed in school settings. These include arranging and composing for the voices of children and adolescents; scoring for school band, orchestra, and chorus; making a keyboard reduction from an instrumental score; preparing scores and parts; and composing short works for choral or instrumental ensemble. The course is designed to replace MUSIC 276 and MUSIC 378 for music education students. Those courses are not geared toward the creation and arrangement of works for school ensembles.","justification":"The course is designed to teach practical skills that are frequently needed in school settings. These include arranging and composing for the voices of children and adolescents; scoring for school band, orchestra, and chorus; making a keyboard reduction from an instrumental score; preparing scores and parts; and composing short works for choral or instrumental ensemble. The course is designed to replace MUSIC 276 and MUSIC 378 for music education students. Those courses are not geared toward the creation and arrangement of works for school ensembles.","title":"Arranging and Composing for School Ensembles"},{"prereq":"Admission to the B.Mus. program as a voice major, or permission of the instructor. ","course_num":"129","text":"AIV.23 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 129. Italian Diction for Singers. 2 hours, 1 credit. \nPrerequisite: Admission to the B.Mus. program as a voice major, or permission of the instructor. \nAn introduction to Italian diction and the International Phonetic Alphabet (IPA). Song and operatic literature will be covered. In-class performance will be required, along with written assignments and examinations.","title":"Italian Diction for Singers","description":"An introduction to Italian diction and the International Phonetic Alphabet (IPA). Song and operatic literature will be covered. In-class performance will be required, along with written assignments and examinations."},{"prereq":"MUSIC 129 or permission of the instructor. ","course_num":"130","hours":"2","credits":"1","text":"AIV.24 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 130. German Diction for Singers. \n2 hours, 1 credit. Prerequisite: MUSIC 129 or permission of the instructor. \nPrerequisite: MUSIC 129 or permission of the instructor. \nAn introduction to German diction and the German song literature; arias from German opera may also be included. In-class performance will be required, along with written assignments and examinations.","title":"German Diction for Singers","description":"An introduction to German diction and the German song literature; arias from German opera may also be included. In-class performance will be required, along with written assignments and examinations."},{"prereq":"MUSIC 130 or permission of the instructor. ","course_num":"229","hours":"2","credits":"1","text":"AIV.25 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 229. French Diction for Singers. \n2 hours, 1 credit. Prerequisite: MUSIC 130 or permission of the instructor. \nPrerequisite: MUSIC 130 or permission of the instructor. \nAn introduction to French diction and the French art song; arias from French opera may also be included. In-class performance will be required, along with written assignments and examinations.","title":"French Diction for Singers","description":"An introduction to French diction and the French art song; arias from French opera may also be included. In-class performance will be required, along with written assignments and examinations."},{"course_num":"230","hours":"2","credits":"1","description":"Students learn to pronounce and sing English in a clear and neutral (non-regional) way, intelligible to any audience. Song and operatic literature will be covered. In-class performance will be required, along with written assignments and examinations.","prereq":"MUSIC 229 or permission of the instructor. ","text":"AIV.26 Music (09-21, approved by Academic Senate 10/15/09)\nMUSIC 230. English Diction for Singers. \n2 hours, 1 credit. Prerequisite: MUSIC 229 or permission of the instructor. \nPrerequisite: MUSIC 229 or permission of the instructor. \nStudents learn to pronounce and sing English in a clear and neutral (non-regional) way, intelligible to any audience. Song and operatic literature will be covered. In-class performance will be required, along with written assignments and examinations.\nJustification: These courses will replace MUSIC 280 and 281 (Diction in Vocal Music I and II). We have found that the practice of covering two languages in each of two semesters is not adequate to the needs of our B.Mus. voice majors. Each language—Italian, German, French, and English—requires an entire semester. The four proposed courses are intended to be taken in the order given here. Exceptions might be made on an individual basis.","justification":"These courses will replace MUSIC 280 and 281 (Diction in Vocal Music I and II). We have found that the practice of covering two languages in each of two semesters is not adequate to the needs of our B.Mus. voice majors. Each language—Italian, German, French, and English—requires an entire semester. The four proposed courses are intended to be taken in the order given here. Exceptions might be made on an individual basis.","title":"English Diction for Singers"},{"course_num":"103","hours":"3","credits":"3","justification":"What is the history and pattern(s) of migration and settlement of a particular group? What are the particular values upon which the group’s culture is based, and how have the individuals within the group contributed to US society? What challenges have the people in this group faced in the past and continue to face in their unique adjustment to US society? How have they met these challenges and which remain to be met?  Further questions related to particular groups will also be raised, particularly with respect to the challenges they face with respect to US social, political, or educational institutions.","text":"AIV.27 Linguistics &amp; Communications Disorders (09-23, approved by Academic Senate 5/7/09)\nLCD 103. Multilingualism in the United States\n3 hr., 3 cr.\nA reading course with an intersection of topics and concepts from linguistics, sociology, anthropology, psychology and education, designed for students interested in gaining a deeper understanding of some of the linguistic and cultural groups that make up US society and the issues that surround and confound them.\nJustification: To gain knowledge and understanding of issues related to culture and values, students will read about diverse groups living in the US, who speak minority dialects (e.g. speakers of African American English) and various languages (e.g. Spanish, Chinese, American Sign Language), and thus belong to a wide range of cultural groups, representing unique values. Students will also read material on controversial issues of unique or common concern to these groups (e.g. Should English be made the “official language” of the US?), examining all sides of each issue and taking a position based on data and evidence. From their readings of language diversity in the US, students will be asked to raise and respond to a set of questions, including: What is the history and pattern(s) of migration and settlement of a particular group? What are the particular values upon which the group’s culture is based, and how have the individuals within the group contributed to US society? What challenges have the people in this group faced in the past and continue to face in their unique adjustment to US society? How have they met these challenges and which remain to be met?  Further questions related to particular groups will also be raised, particularly with respect to the challenges they face with respect to US social, political, or educational institutions.","title":"Multilingualism in the United States","description":"A reading course with an intersection of topics and concepts from linguistics, sociology, anthropology, psychology and education, designed for students interested in gaining a deeper understanding of some of the linguistic and cultural groups that make up US society and the issues that surround and confound them."},{"course_num":"884","hours":"3","credits":"3","justification":"The use of data is an emerging trend in the literature of educational leadership.  Research indicates the importance of data analysis as a viable strategy in school improvement initiatives.  This course enables participants to build a knowledge base to manage and interpret school data findings into specific, measurable improvement goals to (1)enhance proper instructional planning, (2)increase student learning, and (3) support school management operations. Course goals and objectives are consistent with the Queens College Principles for Educational Preparation as identified By the National Association for the Accreditation of Teacher Education (NCATE).","text":"AIV.28 Education and Community Program (08-39, approved by Academic Senate 12/4/08)\nECPEL 884, Data for School Planning. 3hr.; 3 cr. Prereq.::  ECPEL 880, ECPEL 881, ECPEL883, ECPEL, ECPEL 887, ECPEL 888.   (15 credits) \nThis course prepares prospective school administrators to use data as a tool to examine school issues and develop improvement plans.  The course teaches the processes of data analysis, collection and  management, and then requires participants to develop a School Improvement Plan for a real school striving to reverse a pattern of declining student achievement.  The focus is on helping participants work collaboratively to evaluate a wide range of data sources so they can initiate thoughtful plans and recommendations based on data review.\nRationale: The use of data is an emerging trend in the literature of educational leadership.  Research indicates the importance of data analysis as a viable strategy in school improvement initiatives.  This course enables participants to build a knowledge base to manage and interpret school data findings into specific, measurable improvement goals to (1)enhance proper instructional planning, (2)increase student learning, and (3) support school management operations. Course goals and objectives are consistent with the Queens College Principles for Educational Preparation as identified By the National Association for the Accreditation of Teacher Education (NCATE).\nThe course is aligned with the Core Values of the Education Unit of “promoting Equity, Excellence, and Ethics in urbanschools and communities.”  More specifically, the Education Unit is committed to preparing teachers and educational Leaders who \nBuild inclusive communities that nurture and challenge all learners (Equity)\nDemonstrate professionalism, scholarship, efficacy, and evidence-based and reflective practices (Excellence), and \nValue diversity, democracy, and social justice (Ethics).\nThe course is also designed to meet the Interstate School Leadership Licensure Consortium (ISLLC) standards 1, 2, 3, 4, 6, and 7.","title":"Data for School Planning","description":"This course prepares prospective school administrators to use data as a tool to examine school issues and develop improvement plans.  The course teaches the processes of data analysis, collection and  management, and then requires participants to develop a School Improvement Plan for a real school striving to reverse a pattern of declining student achievement.  The focus is on helping participants work collaboratively to evaluate a wide range of data sources so they can initiate thoughtful plans and recommendations based on data review."},{"prereq":"CSCI 700, or the equivalent of CSCI 314 and Econ 249 for students in the Enterprise Risk Management Program. Valuation of financial derivatives is presented as a family of algorithmic computations, centering on understanding and implementation of about fifty selected algorithms.  Concepts include time value of money; market risk and credit risk; arbitrage; forwards and futures on stock, currencies, interest-rates, indices, commodities; collateral, marking-to-market, margining, netting; fundamentals of capital asset pricing; yield curves, bond prices, forward rates; swaps; options, claim synthesis; binomial trees; Weiner processes, Itô’s Lemma, Black-Scholes-Merton model for options; Greeks; implied volatility and term structure;  credit risk, estimates of credit default probabilities, credit default spreads and default intensities; introduction to some path dependent and exotic derivatives.  ","course_num":"","text":"AIV. 29. Computer Science (G09-38, approved by Academic Senate 10/15/09)\nCSCI 765; Computational Finance. 3 hr.; 3 cr.\nPrereq.: CSCI 700, or the equivalent of CSCI 314 and Econ 249 for students in the Enterprise Risk Management Program. Valuation of financial derivatives is presented as a family of algorithmic computations, centering on understanding and implementation of about fifty selected algorithms.  Concepts include time value of money; market risk and credit risk; arbitrage; forwards and futures on stock, currencies, interest-rates, indices, commodities; collateral, marking-to-market, margining, netting; fundamentals of capital asset pricing; yield curves, bond prices, forward rates; swaps; options, claim synthesis; binomial trees; Weiner processes, Itô’s Lemma, Black-Scholes-Merton model for options; Greeks; implied volatility and term structure;  credit risk, estimates of credit default probabilities, credit default spreads and default intensities; introduction to some path dependent and exotic derivatives.  ","title":"3 hr","approval_date":"10/15/09","id":"29","disp":"Computer Science"}]