[{"course_num":"068","hours":"3","credits":"1","description":"An introduction to traditional and contemporary Balinese music through practice and performance on traditional instruments.  Weekly rehearsals lead to one or more concerts.  Instruments and practice space are provided.  May be repeated for credit.  Fall, Spring","prereq":"Permission of the instructor. ","text":"AIV. 1 Music (10-38, approved by Academic Senate 11/11/10)\nMUSIC 068.  Balinese Gamelan Ensemble.  \n3 hr.; 1 cr.  Prereq.: Permission of the instructor. \nPrereq.: Permission of the instructor. \nAn introduction to traditional and contemporary Balinese music through practice and performance on traditional instruments.  Weekly rehearsals lead to one or more concerts.  Instruments and practice space are provided.  May be repeated for credit.  Fall, Spring\nJustification: The course will introduce percussion majors and other qualified students to one of the great non-Western musical traditions.  This is not a course in ethnomusicology (there are no papers and minimal reading) but a performance ensemble.  Hence, like other performance ensembles in the Aaron Copland School of Music, it offers one credit.  The School of Music recently acquired a complete set of gamelan instruments.","justification":"The course will introduce percussion majors and other qualified students to one of the great non-Western musical traditions.  This is not a course in ethnomusicology (there are no papers and minimal reading) but a performance ensemble.  Hence, like other performance ensembles in the Aaron Copland School of Music, it offers one credit.  The School of Music recently acquired a complete set of gamelan instruments.","title":"Balinese Gamelan Ensemble"},{"course_num":"159","hours":"3","credits":"1","justification":"The Aaron Copland School of Music often creates ad hoc performance ensembles or workshops.  Sometimes these ensembles or workshops become more or less permanent (e.g., the Early Music Collective or Introduction to the Alexander Technique) and are assigned separate course numbers.  In other cases an ensemble or workshop exists for a limited period of time, perhaps for a specific performance, and is then dissolved.","text":"AIV. 2 Music (10-38, approved by Academic Senate 11/11/10)\nMUSIC 159.  Topical Workshop in Performance.  3 hr.;1 cr.  Prereq.: Permission of the instructor.\nJustification: The Aaron Copland School of Music often creates ad hoc performance ensembles or workshops.  Sometimes these ensembles or workshops become more or less permanent (e.g., the Early Music Collective or Introduction to the Alexander Technique) and are assigned separate course numbers.  In other cases an ensemble or workshop exists for a limited period of time, perhaps for a specific performance, and is then dissolved.\nThere currently exists no course number for ad hoc ensembles and performance workshops.  Special Topics numbers (Music 390 and 391) are inappropriate for this purpose because, under these numbers, a three-hour-per-week ensemble, which would normally offer one academic credit, is forced to offer three credits.  In several recent cases, an ensemble or workshop has offered more academic credit than its content justified.  The present proposal would remedy that situation.","title":"Topical Workshop in Performance","description":"There currently exists no course number for ad hoc ensembles and performance workshops.  Special Topics numbers (Music 390 and 391) are inappropriate for this purpose because, under these numbers, a three-hour-per-week ensemble, which would normally offer one academic credit, is forced to offer three credits.  In several recent cases, an ensemble or workshop has offered more academic credit than its content justified.  The present proposal would remedy that situation."},{"course_num":"340","hours":"3","credits":"3","justification":"Strengthens the History Department's offerings in Jewish and European history.","text":"AIV. 3 History (10-39, approved by Academic Senate 11/11/10)\nHistory 340. The Jews of Russia and the Soviet Union.  \n3 hr.; 3 cr. The history and culture of Russian Jews from 1881 to the collapse of the Soviet Union in 1991\nThe history and culture of Russian Jews from 1881 to the collapse of the Soviet Union in 1991\nJustification: Strengthens the History Department's offerings in Jewish and European history.","title":"The Jews of Russia and the Soviet Union","description":"The history and culture of Russian Jews from 1881 to the collapse of the Soviet Union in 1991"},{"course_num":"","hours":"3","credits":"3","justification":"This course is designed to fulfill the Culture and Values requirement within the Perspectives on the Liberal Arts and Sciences area of the General Curriculum.  Additionally, it will fulfill the World Cultures area of Context of Experience.  In this course we will be comparing various world dance forms with some contemporary and historical dances in the United States.  ","text":"AIV. 4 Drama, Theatre &amp; Dance (10-40, approved by Academic Senate 11/11/10)\nDANCE 151. Dance and Culture: Dancing Values. \n3 hr.; 3 cr. Comparison of various world dance forms with some contemporary and historical dances in the United States.  The aim of this course is to bring the field of dance to life by showing a wide range of cultural, aesthetic, and historical worlds from which dance is born and which are created by dance.  Students should obtain a fuller understanding of the field of dance and its relationship to other areas of the humanities and social sciences by investigating how dance is a carrier of cultural and aesthetic values across a wide spectrum of forms from around the globe and throughout history.  Utilizing observation, discussions, participation in dance classes and writing about a variety of dance forms, the instructor will guide the students to a deeper understanding of dance as a cultural act.\nComparison of various world dance forms with some contemporary and historical dances in the United States.  The aim of this course is to bring the field of dance to life by showing a wide range of cultural, aesthetic, and historical worlds from which dance is born and which are created by dance.  Students should obtain a fuller understanding of the field of dance and its relationship to other areas of the humanities and social sciences by investigating how dance is a carrier of cultural and aesthetic values across a wide spectrum of forms from around the globe and throughout history.  Utilizing observation, discussions, participation in dance classes and writing about a variety of dance forms, the instructor will guide the students to a deeper understanding of dance as a cultural act.\nJustification:  This course is designed to fulfill the Culture and Values requirement within the Perspectives on the Liberal Arts and Sciences area of the General Curriculum.  Additionally, it will fulfill the World Cultures area of Context of Experience.  In this course we will be comparing various world dance forms with some contemporary and historical dances in the United States.  ","title":"Dancing Values","description":"Comparison of various world dance forms with some contemporary and historical dances in the United States.  The aim of this course is to bring the field of dance to life by showing a wide range of cultural, aesthetic, and historical worlds from which dance is born and which are created by dance.  Students should obtain a fuller understanding of the field of dance and its relationship to other areas of the humanities and social sciences by investigating how dance is a carrier of cultural and aesthetic values across a wide spectrum of forms from around the globe and throughout history.  Utilizing observation, discussions, participation in dance classes and writing about a variety of dance forms, the instructor will guide the students to a deeper understanding of dance as a cultural act."},{"course_num":"","text":"AIV. 5 History (10-42, approved by Academic Senate 11/11/10)\nHIST 390W. Film Aesthetics and History \n3 hr.; 3 cr. Prereq: Junior or Senior Standing. Examination of film as a medium that has documented, and that has itself been part of some of the major social, cultural, and political transformations of the late nineteenth and twentieth centuries. With an equal emphasis on film analysis and history, the course begins with the birth of the medium in 1895 and its immediate challenge to the dominant Victorian ideology of both Europe and the United States. Later historical topics – all examined through the lens of cinema – include WWI and the Russian Revolution, Germany between the World Wars, the Great Depression, and post-WWII U.S. domestic policy. ","title":"Junior or Senior Standing","description":"HIST 390W. Film Aesthetics and History "},{"course_num":"","text":"AIV. 6 History (10-42, approved by Academic Senate 11/11/10)\nHistory 391W   VT: History and Literature\n3 hrs., 3 cr. Prereq: Junior or Senior Standing and completion of the RL and SS core general education areas.\nAn interdisciplinary variable topics course in which the topic is explored from the perspectives of the disciplines of literature and history.  The underlying connections and interplay between history and literature will be examined.","title":"3 cr","description":"History 391W   VT: History and Literature"},{"course_num":"","justification":"This perspectives course provides students with an intensive overview of one of the most important novels of all time.  Students will read a wide variety of literary critical essays that not only enrich the reading experience but also teach students the precepts of several major  schools of literary/cultural theory. Analysis of the history of reinterpretations of this novel in narrative and film enable students to consider the processes through which a text becomes—and remains—a canonical masterpiece and the role of “masterworks” within the liberal arts and larger society.","text":"AIV. 7 ELL Spanish (10-53, approved by Academic Senate 3/10/11)\nSpanish 53  Don Quixote in Translation\n3 hr.; 3 cr. Prereq.: Eng 110. The study of Don Quixote as the first modern and postmodern novel.  Students will learn the disciplinary norms of reading literature, including both close reading and contemporary approaches to literary and cultural theory.  They will analyze Don Quixote in an interdisciplinary context of early modern Spanish history and culture,  including:  early modern imperialism, the expulsion of Jews and Moors from Spain; the rise of urban society, the invention of the printing press and new genres of leisure reading,  and mercantile economic structures. They will also explore the ways in which Don Quixote has been used as a cultural touchstone by authors, philosophers and film makers to support a wide variety of cultural discourses over the past two centuries. (RL, ET)\nJustification: This perspectives course provides students with an intensive overview of one of the most important novels of all time.  Students will read a wide variety of literary critical essays that not only enrich the reading experience but also teach students the precepts of several major  schools of literary/cultural theory. Analysis of the history of reinterpretations of this novel in narrative and film enable students to consider the processes through which a text becomes—and remains—a canonical masterpiece and the role of “masterworks” within the liberal arts and larger society.","title":"Prereq","description":"Spanish 53  Don Quixote in Translation"},{"course_num":"103","hours":"3","credits":"3","text":"AIV. 8 Psychology (11-03, approved by Academic Senate 3/10/11)\nPSYCH 103. Pleasure and Pain\n3 hr.; 3 cr.\nThe psychological, philosophical, biological, neurochemical, sociological and evolutionary facts, principles, and theories underlying the concepts of pleasure and pain. Topics discussed include basic neuroscience and psychology of pleasure and pain systems, application to homeostasis, pain inhibition, and addiction.  Within psychology application is made to concepts of neuroeconomics, wanting vs liking, empathy, and other aspects of human interaction.  Translational implications are explored including psychopathological and neurological disorders and their treatment.  Wider examination of principles learned from these basic mechanisms will be considered from philosophical, anthropological (evolutionary), sociological and economic views, and  include our understanding of these principles from literary, media and other perspectives. Throughout the course, comparisons are made between classic and current theories and empirical data. (NS)\nJustification. In view of the fact that the principles of Pleasure and Pain are involved in a broad realm of human behaviors touching upon almost every aspect of human existence, experience, and motivation, this socially relevant course cuts across many disciplines from the neural and biochemical substrates through the psychological, sociological, economic and evolutionary studies of the motivational root of intact human behaviors, and into the underpinnings of philosophical thought related to motivations and actions. It explores biological (Biology) and chemical (Chemistry) determinants of pleasure and pain as well as the effects of experience and environment in individuals (Psychology), groups (Sociology), cultures (Anthropology) and society (Economics).","title":"Pleasure and Pain","description":"The psychological, philosophical, biological, neurochemical, sociological and evolutionary facts, principles, and theories underlying the concepts of pleasure and pain. Topics discussed include basic neuroscience and psychology of pleasure and pain systems, application to homeostasis, pain inhibition, and addiction.  Within psychology application is made to concepts of neuroeconomics, wanting vs liking, empathy, and other aspects of human interaction.  Translational implications are explored including psychopathological and neurological disorders and their treatment.  Wider examination of principles learned from these basic mechanisms will be considered from philosophical, anthropological (evolutionary), sociological and economic views, and  include our understanding of these principles from literary, media and other perspectives. Throughout the course, comparisons are made between classic and current theories and empirical data. (NS)"}]