[{"course_num":"363","text":"AIV.1. Anthropology (10-46, approved by Academic Senate 12/9/10)\nNew Course proposed as capstone.\nANTH 363. Interpreting the Human Skeleton \n3 hrs lec., 1 hr. lab; 4 credits Pre-requisites:  Anth 260 or two college-level biology courses, Anth 272, Anth 103, and junior standing.\nAn interdisciplinary approach to research on human skeletal remains from archaeological contexts, introducing students to widely accepted methods for reconstructing patterns of subsistence, diet, disease, demography, and physical activity based principally on the analysis of such remains. ","title":"Interpreting the Human Skeleton ","approval_date":"12/9/10","id":"1","description":"New Course proposed as capstone.","disp":"Anthropology"},{"course_num":"375","text":"AIV.2. Anthropology (10-46, approved by Academic Senate 12/9/10)\nNew course proposed as synthesis.\nANTH375. The Human-Primate Interface\nPre-requisite: Senior standing\nExploration of the interface between humans and nonhuman primates from a multi-disciplinary perspective.  Topics include the behavioral biology and ecology of nonhuman primates; the contribution that nonhuman primates can make to the study of the evolution of social behavior and language in humans; the history of primatology as a science; gender issues in science and primatology; the cultural role of primates in societies past and present; the relationship between humans and animals from a philosophical perspective; and historical, economic, and ecological issues related to nonhuman primate conservation, commensalism, and human-wildlife conflict across the globe.","title":"The Human","approval_date":"12/9/10","id":"2","description":"New course proposed as synthesis.","disp":"Anthropology"},{"course_num":"200","approval_date":"10/14/10","description":"2 hr lec, 2 credits. Prerequisites: BIOL 105 and a B- or greater average in biology courses.","text":"AIV.3. Biology (10-28, approved by Academic Senate 10/14/10)\nBiology 200. Foundations of Research in Biology. \n2 hr lec, 2 credits. Prerequisites: BIOL 105 and a B- or greater average in biology courses.\nIntroduction to the critical thinking tools required to conduct research in Biology. Topics include the scientific method, experimental design and hypothesis testing; introductory statistical methods for data analysis; communication of research findings via research papers, posters, and oral talks; and ethics in scientific research. \nBiology 200 is a prerequisite for all students interested in registering in the research project courses BIOL 390, 391, 395, and 396 with faculty members in the Biology Department.\nJustification: Currently no preparatory course for biological research exists in the curriculum.  This course will cover this need, and enable students to gain relevant background in major aspects of biological research by the time they enter a lab for the first time.  This experience will improve the quality of their research and writing, give them confidence in developing and testing hypotheses, and deepen their understanding of the nature, methods, and importance of science.","justification":"Currently no preparatory course for biological research exists in the curriculum.  This course will cover this need, and enable students to gain relevant background in major aspects of biological research by the time they enter a lab for the first time.  This experience will improve the quality of their research and writing, give them confidence in developing and testing hypotheses, and deepen their understanding of the nature, methods, and importance of science.","id":"3","title":"Foundations of Research in Biology","disp":"Biology"},{"course_num":"018","hours":"3","credits":"3","approval_date":"10/14/10","description":"A topical course that treats music within the context of European civilization.  Links between music and the other arts (poetry, painting, theater, dance, etc.) will be explored.  Social and political aspects of music may also be included.  ","text":"AIV.4. Aaron Copland School of Music (10-29, approved by Academic Senate 10/14/10)\nMUSIC 018. Music and European Traditions.  \n3 hr.; 3 cr.  \nA topical course that treats music within the context of European civilization.  Links between music and the other arts (poetry, painting, theater, dance, etc.) will be explored.  Social and political aspects of music may also be included.  \nJustification: MUSIC 018 is designed to satisfy not only the AP requirement of the Perspectives program but also the European Traditions requirement (Contexts of Experience).  Possible topics would include, e.g., Music and the French Revolution, Greek Revivals from Monteverdi to Stravinsky, Music and the Third Reich, or Music in Russia and Eastern Europe.","justification":"MUSIC 018 is designed to satisfy not only the AP requirement of the Perspectives program but also the European Traditions requirement (Contexts of Experience).  Possible topics would include, e.g., Music and the French Revolution, Greek Revivals from Monteverdi to Stravinsky, Music and the Third Reich, or Music in Russia and Eastern Europe.","id":"4","title":"Music and European Traditions","disp":"Aaron Copland School of Music"},{"course_num":"028","hours":"3","credits":"3","approval_date":"10/14/10","description":"A topical course on music within the context of global or non-Western cultures.  Interactions between Western music (from art or popular traditions) and non-Western music may be emphasized. ","text":"AIV.5. Aaron Copland School of Music (10-29, approved by Academic Senate 10/14/10)\nMUSIC 028.  Music in World Culture.  \n3 hr.; 3 cr.  \nA topical course on music within the context of global or non-Western cultures.  Interactions between Western music (from art or popular traditions) and non-Western music may be emphasized. \nJustification: The topics offered as MUSIC 028 will explore the place of music in either one area of the world or within the globalized culture of the present day.  Possible topics would include, e.g., Music in African Cultures, The Music of Southeast Asia, The Music of Latin America and the Caribbean, The Silk Road Project, Global Pop, or Rap and Hip-Hop Around the World.\nMUSIC 028 is designed to satisfy not only the AP requirement of the Perspectives program but also the World Cultures requirement (Contexts of Experience)..","justification":"The topics offered as MUSIC 028 will explore the place of music in either one area of the world or within the globalized culture of the present day.  Possible topics would include, e.g., Music in African Cultures, The Music of Southeast Asia, The Music of Latin America and the Caribbean, The Silk Road Project, Global Pop, or Rap and Hip-Hop Around the World.","id":"5","title":"Music in World Culture","disp":"Aaron Copland School of Music"},{"course_num":"038","hours":"3","credits":"3","approval_date":"10/14/10","description":"A topical course on music in America, emphasizing the place of music within the American experience.  Either art or popular traditions may be explored.  The social, political, and economic functions of American music will be emphasized.  ","text":"AIV.6. Aaron Copland School of Music (10-29, approved by Academic Senate 10/14/10)\nMUSIC 038.  Music in American Culture.  \n3 hr.; 3 cr.  \nA topical course on music in America, emphasizing the place of music within the American experience.  Either art or popular traditions may be explored.  The social, political, and economic functions of American music will be emphasized.  \nJustification: Possible topics for MUSIC 038 would include, e.g., Singing the Blues; Music and the New Deal; Broadway and Tin Pan Alley; or Music, Gender, and Class in American Life.  MUSIC 038 is designed to satisfy not only the AP requirement of the Perspectives program but also the United States requirement (Contexts of Experience)","justification":"Possible topics for MUSIC 038 would include, e.g., Singing the Blues; Music and the New Deal; Broadway and Tin Pan Alley; or Music, Gender, and Class in American Life.  MUSIC 038 is designed to satisfy not only the AP requirement of the Perspectives program but also the United States requirement (Contexts of Experience)","id":"6","title":"Music in American Culture","disp":"Aaron Copland School of Music"},{"course_num":"048","hours":"3","credits":"3","approval_date":"10/14/10","description":"A topical course on European music before 1750.  Topics may be oriented toward a particular body of music, toward music’s role in social or religious life, or toward music’s interaction with other aspects of culture, such as theater, poetry, or dance.","text":"AIV.7. Aaron Copland School of Music (10-29, approved by Academic Senate 10/14/10)\nMUSIC 048.  Music in Pre-Industrial Times.  \n3 hr.; 3 cr.  \nA topical course on European music before 1750.  Topics may be oriented toward a particular body of music, toward music’s role in social or religious life, or toward music’s interaction with other aspects of culture, such as theater, poetry, or dance.\nJustification: Possible topics for MUSIC 048 would include, e.g., Hildegard of Bingen and Her Times, Music and the Reformation, Renaissance Humanism and the Beginning of Opera, or Music and Magic in Early Modern Europe.  MUSIC 048 is designed to satisfy not only the AP requirement of the Perspectives program but also the Pre-Industrial Society requirement (Extended Requirements).","justification":"Possible topics for MUSIC 048 would include, e.g., Hildegard of Bingen and Her Times, Music and the Reformation, Renaissance Humanism and the Beginning of Opera, or Music and Magic in Early Modern Europe.  MUSIC 048 is designed to satisfy not only the AP requirement of the Perspectives program but also the Pre-Industrial Society requirement (Extended Requirements).","id":"7","title":"Music in Pre","disp":"Aaron Copland School of Music"},{"course_num":"159","justification":"This ensemble fills a need of B.A. music majors for an ensemble that provides necessary ensemble experience without the severe technical demands of repertoire performed by the Queens College Orchestra.  Like the Concert Band (MUSIC 059), it is designed for the less advanced player, the student who is not a performance (B.Mus.) major.  Technical instruction given in String Ensemble supplements the instruction given in students’ private performance lessons.  String Ensemble is especially useful for students in our Music Education B.A. program, many of whom will be leading school orchestras in their future careers as educators.","text":"AIV.8. Aaron Copland School of Music (10-31, approved by Academic Senate 10/14/10)\nMUSIC 159. String Ensemble. 2 hours, 1 credit.  Prerequisite: Permission of the instructor.  This ensemble is for undergraduate music majors who play stringed instruments but are not sufficiently advanced to join the Queens College Orchestra.  Aspects of string technique and ensemble playing are emphasized.  May be repeated for credit.  Satisfies the large-ensemble requirement for music majors in B.A. programs only.\nJustification:  This ensemble fills a need of B.A. music majors for an ensemble that provides necessary ensemble experience without the severe technical demands of repertoire performed by the Queens College Orchestra.  Like the Concert Band (MUSIC 059), it is designed for the less advanced player, the student who is not a performance (B.Mus.) major.  Technical instruction given in String Ensemble supplements the instruction given in students’ private performance lessons.  String Ensemble is especially useful for students in our Music Education B.A. program, many of whom will be leading school orchestras in their future careers as educators.","title":"String Ensemble","approval_date":"10/14/10","id":"8","disp":"Aaron Copland School of Music"},{"course_num":"701","hours":"2","credits":"2","justification":"We will soon submit a proposal to the GCC to revise our M.A. program in classical performance. Among other changes, the proposal will list MUSIC 701 as a required course in this degree program; it will also specify that the course be taken during the first or second semester of residence. The course will be offered once per year.]","text":"AIV. 9 Aaron Copland School of Music (G10-12, approved by Academic Senate 11/11/10)\nMUSIC 701. Writing about Music. 2 hr.; 2 cr. Prereq.;  acceptance into the M.A. program in classical performance, or permission of instructor.\nThe course is designed for M.A. students in classical performance. It should be taken during the first or second semester of residence. Students will acquire the skills needed to research and write about topics in music. The use of library resources, both paper and online, will be emphasized. \nJustification: [Note:  We will soon submit a proposal to the GCC to revise our M.A. program in classical performance. Among other changes, the proposal will list MUSIC 701 as a required course in this degree program; it will also specify that the course be taken during the first or second semester of residence. The course will be offered once per year.]\nMore than ever, performing musicians need to be able to communicate with audiences—both orally, from the stage, and in writing, whether online or in printed program notes. The ability to carry out research on the music one performs is crucial. MUSIC 701 will fill a gap in the background of many M.A. performance students, especially those who come to Queens College from conservatories rather than liberal-arts colleges. The course will teach them the basics of music research. It is intended, in particular, to equip students to write the detailed program notes that Queens College requires for their degree recitals. In addition to imparting research skills, the course will improve students’ writing. It will help prepare them for doctoral study in performance, should they choose to pursue it.","title":"Writing about Music","description":"The course is designed for M.A. students in classical performance. It should be taken during the first or second semester of residence. Students will acquire the skills needed to research and write about topics in music. The use of library resources, both paper and online, will be emphasized. "},{"course_num":"758","hours":"3","credits":"2","justification":"The proposed course would be a counterpart to MUSIC 759, which is a graduate review course in music theory. Currently, students who fail the written part of the Theory Qualifying Exam may satisfy this requirement by achieving a grade of B- or higher in MUSIC 759. By contrast, the three “musicianship” parts of the exam—sight singing, dictation, and keyboard harmony—can, at present, only be passed by examination; we have had no graduate course that covers this material.","text":"AIV. 10  Aaron Copland School of Music (G10-12, approved by Academic Senate 11/11/10)\nMUSIC 758. Musicianship for Graduate Students. 3 hr.; 2 cr. Prereq.: acceptance into the M.A. program in music; students must also have taken the Theory Qualifying Examination (all four parts); the course is designed for students who have not passed one or more of the following parts of the examination: sight singing, dictation, or keyboard harmony.\nAn intensive course in sight singing, dictation, and keyboard harmony for graduate students. Students may place out of MUSIC 758 by passing these three parts of the Theory Qualifying Examination. This course is not available to students in Music Education.\nA grade of B- or higher in MUSIC 758 will be regarded as equivalent to a passing grade in the sight-singing, dictation, and keyboard parts of the Theory Qualifying Examination, provided that the student also achieves a passing grade in each of these areas.\nRationale: The proposed course would be a counterpart to MUSIC 759, which is a graduate review course in music theory. Currently, students who fail the written part of the Theory Qualifying Exam may satisfy this requirement by achieving a grade of B- or higher in MUSIC 759. By contrast, the three “musicianship” parts of the exam—sight singing, dictation, and keyboard harmony—can, at present, only be passed by examination; we have had no graduate course that covers this material.","title":"Musicianship for Graduate Students","description":"An intensive course in sight singing, dictation, and keyboard harmony for graduate students. Students may place out of MUSIC 758 by passing these three parts of the Theory Qualifying Examination. This course is not available to students in Music Education."},{"course_num":"606","hours":"3","credits":"1","description":"A mixed college-community chorus devoted to the study and performance of large choral masterpieces such as Messiah, Creation, and Elijah.  Meets together with MUSIC 254 (Queens College Choral Society).  May be repeated for credit to a maximum of 4 times.  Fall, Spring.","prereq":"Permission of the Instructor. ","text":"AIV. 11  Aaron Copland School of Music (G10-18, approved by Academic Senate 11/11/10)\nMUSIC 606. Queens College Choral Society. \n3 hr.; 1 cr. Prereq.: Permission of the Instructor. \nPrereq.: Permission of the Instructor. \nA mixed college-community chorus devoted to the study and performance of large choral masterpieces such as Messiah, Creation, and Elijah.  Meets together with MUSIC 254 (Queens College Choral Society).  May be repeated for credit to a maximum of 4 times.  Fall, Spring.\nRationale: Graduate students, particularly in Music Education, often wish to participate in a large ensemble.  This is valuable for many reasons.  In the case of Music Education majors specializing in choral music, participating in a large college-community chorus enables them to sharpen their sight-singing and foreign language/diction skills, practice healthy vocal techniques, and improve all aspects of their musicianship through the preparation and performance of choral masterpieces.\nIn addition, graduate students involved in the Queens College Choral Society benefit from observing and experiencing the pedagogical methods used to train a large ensemble composed primarily of adult amateur singers.  They are often involved in working with singers of a similar background in their professional lives, and they are encouraged to take and apply techniques they are learning as members of the Queens College Choral Society to their own choral groups.\nThe only way at present we have to register a graduate student for the Queens College Choral Society is by creating a section of MUS 790.1 (“Special Problems”).  As more and more graduate students have begun to enroll in the Choral Society for credit, this process has become very cumbersome.  It would be much easier and more efficient for the Choral Society to have its own graduate number—in the same way that the Queens College Vocal Ensemble and the Queens College Concert Choir have both graduate and undergraduate course numbers.","justification":"Graduate students, particularly in Music Education, often wish to participate in a large ensemble.  This is valuable for many reasons.  In the case of Music Education majors specializing in choral music, participating in a large college-community chorus enables them to sharpen their sight-singing and foreign language/diction skills, practice healthy vocal techniques, and improve all aspects of their musicianship through the preparation and performance of choral masterpieces.","title":"Queens College Choral Society"},{"course_num":"797","hours":"3","credits":"1","description":"An introduction to traditional and contemporary Balinese music through practice and performance on traditional instruments. Weekly rehearsals lead to one or more concerts. Instruments and practice space are provided. May be repeated for credit to a maximum of 4 times. Fall, Spring","prereq":"Permission of instructor.","text":"AIV. 12  Aaron Copland School of Music (G10-18, approved by Academic Senate 11/11/10)\nMUSIC 797. Balinese Gamelan\n3 hr.; 1 cr. Prereq.: Permission of instructor.\nPrereq.: Permission of instructor.\nAn introduction to traditional and contemporary Balinese music through practice and performance on traditional instruments. Weekly rehearsals lead to one or more concerts. Instruments and practice space are provided. May be repeated for credit to a maximum of 4 times. Fall, Spring\nRationale: The course, an elective, will introduce percussionists and other students to one of the great non-Western musical traditions. This is not a course in ethnomusicology (there are no papers and minimal reading) but a performance ensemble. The course will be cross-listed with MUSIC 068, Balinese Gamelan, which is being proposed simultaneously to the Undergraduate Curriculum Committee. No prior experience playing gamelan instruments is assumed or expected.\nGraduate courses for 3 credits typically meet 3 hours per week, the “2 hour plus conference” being an exception. If the proposed course is a “2 hour plus conference” course, please give a detailed rationale explaining why this format is appropriate. \nAlmost all performance ensembles in the School of Music are offered for 3 hours, 1 credit. This has to do with the nature of a performance-based course, in which weekly rehearsal attendance is the primary component. Most of the work is done in rehearsal;  there is much less outside preparation than in a standard graduate seminar, which is typically 3 hours, 3 credits.","justification":"The course, an elective, will introduce percussionists and other students to one of the great non-Western musical traditions. This is not a course in ethnomusicology (there are no papers and minimal reading) but a performance ensemble. The course will be cross-listed with MUSIC 068, Balinese Gamelan, which is being proposed simultaneously to the Undergraduate Curriculum Committee. No prior experience playing gamelan instruments is assumed or expected.","title":"Balinese Gamelan"},{"course_num":"704","hours":"3","credits":"3","text":"AIV. 13  Accounting (G10-19, approved by Academic Senate 11/11/10)\nRisk Management (RM) 704. Risk Measurement. 3 hr.; 3 cr. Prereq. or coreq. : RM 701, Risk Management. This course provides an in-depth review of the fundamentals of probability and statistics, followed by the measurement of various risk types. The course examines instances of market failure, the role of collateralization requirements, the impact of term, time horizon, and covariance, and extreme value theory. The course also covers probabilistic and stochastic risk modeling, calculations of value-at-risk, stress testing, and other risk metrics, and the limitations of each of these measures.","title":"Risk Measurement"},{"course_num":"705","hours":"3","credits":"3","text":"AIV. 14  Accounting (G10-19, approved by Academic Senate 11/11/10)\nRisk Management (RM) 705, Risk Transfer to Financial Markets. 3 hr.; 3 cr. Prereq. or coreq.: RM 701, Introduction to Risk Management; RM 703 or BUS 350, Investment Analysis is recommended. The primary emphasis of this course is on the structure, pricing, hedging, and strategies of futures and options contracts and their applications in a risk management context. The economic role of options and futures markets is examined. Specific topics include: determinants of forward and futures prices, option valuation using binomial trees and Monte Carlo simulation, implied binomial trees, relation between puts and calls, uses of options in investment strategies, hedging techniques, exotic options, applications to corporate securities and other financial instruments.","title":"Risk Transfer to Financial Markets"},{"course_num":"706","hours":"3","credits":"3","justification":"These changes integrate related coursework from the approved MS in Risk Management program to the economics component of the MS in Accounting program.","text":"AIV. 15  Accounting (G10-19, approved by Academic Senate 11/11/10)\nRisk Management (RM) 706, Risk Transfer to Insurance Markets. 3 hr.; 3 cr. Prereq. or coreq.: Undergraduate degree in accounting or completion of Graduate Core Curriculum: ECON 601, Introduction to Micro- and Macro-Economics; ECON 602, Introduction to Corporate Finance and Money and Banking; ECON 649, Statistics as Applied to Economics and Business; and ACCT 600, Financial Theory and Accounting Practice, Part I, or permission of program director. RM 701, Introduction to Risk Management is recommended. This course examines risk transfer to insurance markets. Topics covered will include the variety of ways that risk transfer can occur including quota share and excess of loss agreements, catastrophe bonds, captives, reciprocals, segregated cells, and their structuring, such as retentions, limits, corridors, collateralization, reinstatement, and commutation provisions, and structured/financial insurance. Insurance products will be evaluated for their efficiency in risk transfer. How effective insurance markets are relative to capital markets will be evaluated in terms of terms and conditions, pricing, and basis risk.\nJustification:","title":"Risk Transfer to Insurance Markets"}]