[{"course_num":"383","hours":"3","credits":"3","description":"An examination of computational approaches to problem solving in a variety of contexts, either within the Computer Science discipline or between Computer Science and other disciplines. Students will be given an understanding of how knowledge is developed and managed using digital technologies in a various disciplines. How the course implements this structure will vary across offerings, but typically will involve determining what kinds of information form the basis for a discipline, a survey of techniques for storing and manipulating that information, and a project that either gives the student experience working with actual datasets from the discipline or investigation into alternate ways of gathering, storing, and accessing that information.","prereq":"Permission of instructor. May be repeated for credit when topics differ.","text":"AIV. 1 Computer Science (11-05, approved by Academic Senate 4/14/11)\nCSCI 383:VT Computer Science Synthesis\n3 hr.; 3 cr. Prereq.: Permission of instructor. May be repeated for credit when topics differ.\nPrereq.: Permission of instructor. May be repeated for credit when topics differ.\nAn examination of computational approaches to problem solving in a variety of contexts, either within the Computer Science discipline or between Computer Science and other disciplines. Students will be given an understanding of how knowledge is developed and managed using digital technologies in a various disciplines. How the course implements this structure will vary across offerings, but typically will involve determining what kinds of information form the basis for a discipline, a survey of techniques for storing and manipulating that information, and a project that either gives the student experience working with actual datasets from the discipline or investigation into alternate ways of gathering, storing, and accessing that information.\nJustification: The course examines the ways in which digital representation of information and algorithmic analysis/manipulation of that information operate in a variety of disciplines as well as fields of endeavor that do not fit neatly into traditional academic discipline rubrics.\nThere is no limit to the range of topics that would be suitable for this course, primarily because the boundaries of computational approaches continue to expand. Language, climate, social structures, biological systems, communication methodologies, and the arts are just a few of possibilities.\nWhat all instances of the course will have in common is that they will be structured so that they extend students understanding of how knowledge is developed and managed using digital technologies in a various disciplines. How the course implements this structure will vary across offerings, but typically will involve (a) determining what kinds of information form the basis for a discipline, (b) a survey of techniques for storing and manipulating that information, and (b) a project that either gives the student experience working with actual datasets from the discipline or investigation into alternate ways of gathering, storing, and accessing that information.\nAlthough it is not an essential component of this course, we do explicitly intend it as a vehicle for developing course instances that involve coordinated efforts between members of the Computer Science Department and other departments/divisions on campus.","justification":"The course examines the ways in which digital representation of information and algorithmic analysis/manipulation of that information operate in a variety of disciplines as well as fields of endeavor that do not fit neatly into traditional academic discipline rubrics.","title":"VT Computer Science Synthesis"},{"course_num":"385","hours":"3","credits":"3","description":"Each offering of this course will have a pre-announced theme that will serve as the basis for student projects that draw on one or more areas of computer science: typically, knowledge developed in previous courses in the major. Students will have the option of working in small groups, but may work individually instead. Each project group will present their initial project plan and final project summary to the class, with constructive critiques of others’ projects an essential component of the course structure.","prereq":"Open to upper division computer science majors. May be repeated for credit when project themes differ.","text":"AIV. 2 Computer Science (11-05, approved by Academic Senate 4/14/11)\nCSCI 385:VT Computer Science Capstone\n3 hr.; 3 cr. Prerequisite: Open to upper division computer science majors. May be repeated for credit when project themes differ.\nPrerequisite: Open to upper division computer science majors. May be repeated for credit when project themes differ.\nEach offering of this course will have a pre-announced theme that will serve as the basis for student projects that draw on one or more areas of computer science: typically, knowledge developed in previous courses in the major. Students will have the option of working in small groups, but may work individually instead. Each project group will present their initial project plan and final project summary to the class, with constructive critiques of others’ projects an essential component of the course structure.\nJustification: This course is intended to fill a missing element in the Computer Science majors at Queens College that is not only common in other institutions and other disciplines, but which is actually a new degree requirement at the college: all students are required to complete an integrative/culminating experience as part of their upper level general education requirements for the degree.\nInstituting this course, however, does not actually change the requirements for either of the majors offered by the department (BA or BS). Rather, by letting this course and its companion CSCI 383:VT serve as elective courses for the major, students will have the option of completing their general education requirements either within the department or elsewhere while at the same time leaving the number of courses required for the major unchanged.","justification":"all students are required to complete an integrative/culminating experience as part of their upper level general education requirements for the degree.","title":"VT Computer Science Capstone"},{"course_num":"107","hours":"3","credits":"3","justification":"This course fulfills two general education requirements. Through its comparative study of “new” and “old” American experiences, its deconstruction of the concept of a “culturally diverse” society, and its discussion of how local communities can be simultaneously global, this course fulfills the “Analyzing Social Structures” Area requirement. Since this course discusses the demographic changes and social movements underway in urban America, the issues underlying multicultural America, and the connection between local counties such as Queens and national and global forces, it fulfills the “United States” Context of Experience requirement.","text":"AIV. 3 Urban Studies (11-06, approved by Academic Senate 4/14/11)\nURBST 107. Urban Communities: Local-Global Connections in Queens\n3 hr., 3 cr.\nAn introduction to the diverse communities of Queens and the local and global issues and networks encountered in them. It focuses on how immigration has created complex settings with multiple cultural groups moving into and out of local neighborhoods. Students will examine the changing demographics and intercultural relations that mark multicultural Queens. They will see how these communities are addressing a series of issues ranging from economic struggles, to the formation of new socio-cultural identities, to new forms of civic and political participation. This course provides an opportunity for students to analyze their individual identity in the context of the cultural diversity of Queens and to perceive their own community within an increasingly globalized world.\nJustification: This course fulfills two general education requirements. Through its comparative study of “new” and “old” American experiences, its deconstruction of the concept of a “culturally diverse” society, and its discussion of how local communities can be simultaneously global, this course fulfills the “Analyzing Social Structures” Area requirement. Since this course discusses the demographic changes and social movements underway in urban America, the issues underlying multicultural America, and the connection between local counties such as Queens and national and global forces, it fulfills the “United States” Context of Experience requirement.","title":"Urban Communities","description":"An introduction to the diverse communities of Queens and the local and global issues and networks encountered in them. It focuses on how immigration has created complex settings with multiple cultural groups moving into and out of local neighborhoods. Students will examine the changing demographics and intercultural relations that mark multicultural Queens. They will see how these communities are addressing a series of issues ranging from economic struggles, to the formation of new socio-cultural identities, to new forms of civic and political participation. This course provides an opportunity for students to analyze their individual identity in the context of the cultural diversity of Queens and to perceive their own community within an increasingly globalized world."},{"course_num":"114","hours":"4","credits":"4","text":"AIV. 4 Hispanic Languages &amp; Literatures (11-02, approved by Academic Senate 5/5/11)\nSpanish 114. Spanish for Heritage Speakers I\n4 hours, 4 credits. Not open to students who have received credit for Spanish 111.\nNot open to students who have received credit for Spanish 111.\nDesigned for heritage speakers of Spanish (students whose native language is Spanish but who have gone to school in the U.S.) this course focuses on the development of communicative competence in reading, writing, speaking, and listening, as well as on understanding Hispanic cultures and issues of identity of heritage speakers of Spanish in the United States.","title":"Spanish for Heritage Speakers I","description":"Not open to students who have received credit for Spanish 111."},{"prereq":"Spanish 114 (or equivalent) Not open to students who have received credit for Spanish 111 or 112.","course_num":"115","hours":"4","credits":"4","text":"AIV. 5 Hispanic Languages &amp; Literatures (11-02, approved by Academic Senate 5/5/11)\nSpanish 115. Spanish for Heritage Speakers II\n4 hours, 4 credits. Prerequisite:  Spanish 114 (or equivalent) Not open to students who have received credit for Spanish 111 or 112.\nPrerequisite:  Spanish 114 (or equivalent) Not open to students who have received credit for Spanish 111 or 112.\nA continuation of Spanish 114 providing heritage speakers of Spanish (students whose native language is Spanish but who have gone to school in the U.S.) grammar review needed for oral and written expression and emphasizing the active use of the language through task-oriented activities and discussion of cultural and literary texts.","title":"Spanish for Heritage Speakers II","description":"A continuation of Spanish 114 providing heritage speakers of Spanish (students whose native language is Spanish but who have gone to school in the U.S.) grammar review needed for oral and written expression and emphasizing the active use of the language through task-oriented activities and discussion of cultural and literary texts."},{"prereq":"Fluency in speaking and understanding Spanish, as determined by a placement test or instructor’s recommendation. Not open to students who have completed Spanish 111, 112 or 203.","course_num":"201","hours":"3","credits":"3","text":"AIV. 6 Hispanic Languages &amp; Literatures (11-02, approved by Academic Senate 5/5/11)\nSpanish 201. Spanish for Heritage Speakers III. \n3 hours, 3 credits. Prerequisite: Fluency in speaking and understanding Spanish, as determined by a placement test or instructor’s recommendation. Not open to students who have completed Spanish 111, 112 or 203.\nPrerequisite: Fluency in speaking and understanding Spanish, as determined by a placement test or instructor’s recommendation. Not open to students who have completed Spanish 111, 112 or 203.\nA review of Spanish grammar with emphasis on reading and writing skills for students who are fluent in the spoken language but have little previous experience in the written language.  Instruction will be primarily in Spanish. Completion of this course is equivalent to completion of Spanish 203. ","title":"Spanish for Heritage Speakers III","description":"A review of Spanish grammar with emphasis on reading and writing skills for students who are fluent in the spoken language but have little previous experience in the written language.  Instruction will be primarily in Spanish. Completion of this course is equivalent to completion of Spanish 203. "},{"course_num":"258","justification":"This course has been offered on an experimental basis during Fall 2007 and Fall 2009. It provides students with an opportunity to explore the increasingly important issue of global climate change, to understand the science, politics, and economics behind it, and to analyze the various national and local public policies being proposed to address it. This course will be offered as part of the Environmental Studies major, which the Urban Studies Department will be offering in collaboration with the School of Earth and Environmental Sciences. ","text":"AIV. 7 Urban Studies (11-09, approved by Academic Senate 5/5/11)\nURBST 258. Climate Change and Public Policy. \n3 cr., 3 hr. \nExamination of the science, politics, and economics of global climate change and its likely impact on humankind’s use of energy. Data showing the past and likely future of global warming will be examined, including alternative interpretations and the controversy surrounding these data. The future of energy production and consumption will be studied. Issues related to climate change including population growth, urbanization, transportation, energy consumption and energy alternatives will be discussed. The role of public policy, including urban policy, and of the environmental movement will be examined. Videos, internet sources, and guest speakers will be brought into the course to provide the most up-to-date information. Students will examine and report on particular topics raised in the course.\nJustification: This course has been offered on an experimental basis during Fall 2007 and Fall 2009. It provides students with an opportunity to explore the increasingly important issue of global climate change, to understand the science, politics, and economics behind it, and to analyze the various national and local public policies being proposed to address it. This course will be offered as part of the Environmental Studies major, which the Urban Studies Department will be offering in collaboration with the School of Earth and Environmental Sciences. ","title":"Climate Change and Public Policy","description":"3 cr., 3 hr. "},{"course_num":"350","text":"AIV. 8 Education and Community Programs (11-10, approved by Academic Senate 5/5/11)\nECPSE 350. Foundations of Special Education\n3 hrs, plus 15 hours of fieldwork, 3 credits.  Prerequisites SEYS 221, EECE 310; and either SEYS 201 or EECE 201. Co-requisite: A discipline-specific teacher educator course with additional fieldwork as determined in consultation with an adviser.\nPreparation of teacher education candidates with the knowledge, skills, and dispositions necessary to provide instruction that will promote the participation and progress of students with disabilities in the general education curriculum and prepares candidates with competencies to work collaboratively with colleagues. Teacher education candidates across certification areas and age-ranges are exposed to research-validated professional practice that result in the creation of effective instructional environments for all students, with specific focus on those students who are classified for special education services and supports with mild, moderate, and severe disabilities. The historical and sociological treatment of people with disabilities, special education law, adapting curriculum and instruction, understanding Individualized Education Programs (IEPs), participating in IEP meetings, and advocacy and collaboration are also addressed. Candidates are provided with multiple opportunities to engage in reflective practice regarding the implications of course content to their specific educational disciplines in terms of personalizing instruction and building classroom communities that support the full diversity of learners. Fifteen total hours of fieldwork focusing on meeting the needs of students with disabilities within candidates’ certification area or age-range are required.","title":"Foundations of Special Education","description":"3 hrs, plus 15 hours of fieldwork, 3 credits.  Prerequisites SEYS 221, EECE 310; and either SEYS 201 or EECE 201. Co-requisite: A discipline-specific teacher educator course with additional fieldwork as determined in consultation with an adviser."},{"course_num":"248","hours":"3","credits":"3","justification":". Since many Urban Studies students currently work in, or will work in, bureaucratic organizations such as City and State government, it is valuable for them to understand how they function. This course introduces them to the various theoretical approaches to understanding the behavior of large organizations. This course has been offered successfully a number of times as an experimental course.","text":"AIV. 9 Urban Studies (11-12, approved by Academic Senate 5/5/11)\nURBST 248. Organizational Behavior and Urban Politics.  \n3 hr., 3 cr. \nAn introduction to the theory of the operation and behavior of public, private, and nonprofit organizations. Students will be introduced to the works of theorists such as Woodrow Wilson, Max Weber, Frederick Taylor, Chester Barnard, Robert Merton, Abraham Maslow, Douglas MacGregor, Frederick Moshier, Robert Dahl, and Charles Lindblom.  Students will examine selected aspects of organizational operation including organizational decision-making, organizational culture, motivation and politics. The course will study human behavior in organizations at the individual and group level, including the effect of organizational structure on employees’ performance. Issues such as diversity in the workplace, ethics, and social responsibility will be analyzed and specific problems discussed in detail. Case analyses are drawn from City and State agencies and contemporary political issues.\nJustification:. Since many Urban Studies students currently work in, or will work in, bureaucratic organizations such as City and State government, it is valuable for them to understand how they function. This course introduces them to the various theoretical approaches to understanding the behavior of large organizations. This course has been offered successfully a number of times as an experimental course.","title":"Organizational Behavior and Urban Politics","description":"An introduction to the theory of the operation and behavior of public, private, and nonprofit organizations. Students will be introduced to the works of theorists such as Woodrow Wilson, Max Weber, Frederick Taylor, Chester Barnard, Robert Merton, Abraham Maslow, Douglas MacGregor, Frederick Moshier, Robert Dahl, and Charles Lindblom.  Students will examine selected aspects of organizational operation including organizational decision-making, organizational culture, motivation and politics. The course will study human behavior in organizations at the individual and group level, including the effect of organizational structure on employees’ performance. Issues such as diversity in the workplace, ethics, and social responsibility will be analyzed and specific problems discussed in detail. Case analyses are drawn from City and State agencies and contemporary political issues."},{"course_num":"","hours":"3","credits":"3","justification":"This course highlights the fact that diseases are not treated equally by the medical establishment or government, nor is their treatment based simply upon the seriousness (as measured by the number of sufferers and the severity of morbidity/ mortality that they entail) or their effects on the population. The course deals with the various ways that individuals and groups within the society champion, successfully and unsuccessfully, different diseases.  The course looks at  entities as different as infectious diseases such as hepatitis B, hepatitis C and AIDS, and  chronic ailments such as multiple sclerosis, chronic fatigue syndrome, and sick building syndrome. The widespread belief that widespread suffering and high epidemiologic burden automatically produce medical, scientific, media and government interest and support is mistaken. Instead, an elaborate political process of organizing support, attracting attention, creating alliances with medical specialties and institutes, and lobbying government at all levels, is involved.  As a result some diseases successfully &quot;emerge,&quot; while others remain neglected or even denied the status of  legitimate ailment. Understanding this phenomenon  is the goal of this course.","text":"AIV. 10 Urban Studies (11-12, approved by Academic Senate 5/5/11)\nURBST 234. Advocacy, Politics, and Disease.  \n3 hr., 3 cr.\nThe politics of emergent diseases, the controversies and conflicts among various social groups -- communities of sufferers,  &quot;disease champions,&quot; medical specialists,  and their disciplinary organizations, biomedical researchers and their institutions, politicians and political institutions at the local, state and federal levels, and governmental bureaucracies -- and their impact on whether or not an emergent disease is recognized as a legitimate ailment, and if it is, what level of priority or neglect it deserves in the allotment of scarce financial and bio/scientific resources. The course emphasizes diseases found  disproportionately in urban populations, but not to the exclusion of diseases found scattered in the general population.\nJustification: This course highlights the fact that diseases are not treated equally by the medical establishment or government, nor is their treatment based simply upon the seriousness (as measured by the number of sufferers and the severity of morbidity/ mortality that they entail) or their effects on the population. The course deals with the various ways that individuals and groups within the society champion, successfully and unsuccessfully, different diseases.  The course looks at  entities as different as infectious diseases such as hepatitis B, hepatitis C and AIDS, and  chronic ailments such as multiple sclerosis, chronic fatigue syndrome, and sick building syndrome. The widespread belief that widespread suffering and high epidemiologic burden automatically produce medical, scientific, media and government interest and support is mistaken. Instead, an elaborate political process of organizing support, attracting attention, creating alliances with medical specialties and institutes, and lobbying government at all levels, is involved.  As a result some diseases successfully &quot;emerge,&quot; while others remain neglected or even denied the status of  legitimate ailment. Understanding this phenomenon  is the goal of this course.\nThis has course has been offered a number of times over the past several years as an online course, though it could be offered &quot;offline&quot; as well. The syllabus below is for the online version of the course.","title":"and Disease","description":"The politics of emergent diseases, the controversies and conflicts among various social groups -- communities of sufferers,  &quot;disease champions,&quot; medical specialists,  and their disciplinary organizations, biomedical researchers and their institutions, politicians and political institutions at the local, state and federal levels, and governmental bureaucracies -- and their impact on whether or not an emergent disease is recognized as a legitimate ailment, and if it is, what level of priority or neglect it deserves in the allotment of scarce financial and bio/scientific resources. The course emphasizes diseases found  disproportionately in urban populations, but not to the exclusion of diseases found scattered in the general population."},{"course_num":"260","hours":"3","credits":"3","justification":"The actual processes by which land use decisions get made are of central concern to anyone interested in urban life. This course provides a brief overview of the legal and bureaucratic processes that govern land use, but the core of the course is a series of case studies of contemporary issues relating to land use, emphasizing the political nature of those decisions. This course has been offered successfully a number of times over the past few years as an experimental course.","text":"AIV. 11 Urban Studies (11-12, approved by Academic Senate 5/5/11)\nURBST 260. Planning and Politics.  \n3 hr., 3 cr. \nLand use planning in New York City is governed by a number of regulatory programs including zoning, environmental regulations, and the NYC building code. However, in New York City, as in many other cities, powerful economic and political forces really determine how land is developed. Community and special interest groups confront politicians and developers in determining what eventually gets built. This course looks at all of these factors, focusing in particular on current planning controversies.\nJustification: The actual processes by which land use decisions get made are of central concern to anyone interested in urban life. This course provides a brief overview of the legal and bureaucratic processes that govern land use, but the core of the course is a series of case studies of contemporary issues relating to land use, emphasizing the political nature of those decisions. This course has been offered successfully a number of times over the past few years as an experimental course.","title":"Planning and Politics","description":"Land use planning in New York City is governed by a number of regulatory programs including zoning, environmental regulations, and the NYC building code. However, in New York City, as in many other cities, powerful economic and political forces really determine how land is developed. Community and special interest groups confront politicians and developers in determining what eventually gets built. This course looks at all of these factors, focusing in particular on current planning controversies."},{"course_num":"373","hours":"3","credits":"3","justification":"This course is being developed in conjunction with the revision of the Environmental Studies major. It will provide Environmental Studies major the opportunity to examine a real-world environmental problem and to develop alternative policy recommendations to address it. Wherever possible, it will be run in parallel with ENSCI 373, in which studies will investigate the scientific aspects of an environmental problem. Students in URBST 373 will then examine the policy and management aspects of the same problem.","text":"AIV. 12 Urban Studies (11-15, approved by Academic Senate 5/5/11)\nURBST 373. Special Problems in Environmental Studies. \n3 hr., 3 cr. \nA seminar-type course at the advanced level. \nOpen to environmental studies and environmental science majors. Research into an actual environmental policy or management problem through interactive, self-directed investigations by student teams. Oral and written presentations will be required. \n(May be repeated for credit provided the project is different.)\nJustification: This course is being developed in conjunction with the revision of the Environmental Studies major. It will provide Environmental Studies major the opportunity to examine a real-world environmental problem and to develop alternative policy recommendations to address it. Wherever possible, it will be run in parallel with ENSCI 373, in which studies will investigate the scientific aspects of an environmental problem. Students in URBST 373 will then examine the policy and management aspects of the same problem.","title":"Special Problems in Environmental Studies","description":"A seminar-type course at the advanced level. "},{"course_num":"372","justification":"This course is being developed in conjunction with the revision of the Environmental Studies major. It will build on the experience that the Urban Studies Department has accumulated through URBST 370, Fieldwork in Urban Studies, which is required of Urban Studies majors and which it has been conducting for many years. URBST 372 will differ primarily in that the field sites will be organizations engaged in environmental management, advocacy, or other activities related to environmental studies.","text":"AIV. 13 Urban Studies (11-15, approved by Academic Senate 5/5/11)\nURBST 372. Fieldwork in Environmental Studies, \n1–7 hr. fieldwork; 3 cr. Prereq.: Permission of the department. \nThis course is designed to give the student practical experience in environmental studies and may take a variety of forms, such as development and execution of a research project requiring collection of data in the field, or practical experience under special supervision in a public or non-profit institution carrying out environmental activities. Students will be assigned appropriate required reading. (May be repeated once for credit provided the project is different.)\nJustification: This course is being developed in conjunction with the revision of the Environmental Studies major. It will build on the experience that the Urban Studies Department has accumulated through URBST 370, Fieldwork in Urban Studies, which is required of Urban Studies majors and which it has been conducting for many years. URBST 372 will differ primarily in that the field sites will be organizations engaged in environmental management, advocacy, or other activities related to environmental studies.","title":"Fieldwork in Environmental Studies","description":"1–7 hr. fieldwork; 3 cr. Prereq.: Permission of the department. "},{"course_num":"107","hours":"3","credits":"3","text":"AIV. 14 Urban Studies (11-16, approved by Academic Senate 5/5/11)\nAACS 107: Experience Queens: Cultural Diversity and Local-Global Communities. \n3 hr., 3 cr.\nAn introduction to the diverse communities of Queens and the local and global issues and networks encountered in them. The students will have an opportunity to analyze their individual identity in the context of the cultural diversity of Queens and to perceive their own community within an increasingly globalized world.","title":"Experience Queens","description":"An introduction to the diverse communities of Queens and the local and global issues and networks encountered in them. The students will have an opportunity to analyze their individual identity in the context of the cultural diversity of Queens and to perceive their own community within an increasingly globalized world."},{"prereq":"AACS 107. ","course_num":"200","hours":"3","credits":"3","text":"AIV. 15 Urban Studies (11-16, approved by Academic Senate 5/5/11)\nAACS 200: Making of Asian/American History.\n3 hr. 3 cr. Prereq: AACS 107. \nPrereq: AACS 107. \nAn historical overview of different Asian Americans communities, their immigration to the United States, the formation of an Asian American identity around common cultural backgrounds and social issues, relations between Asian Americans and multicultural America, and significance of documenting history of groups such as Asian Americans. ","title":"Making of Asian","description":"An historical overview of different Asian Americans communities, their immigration to the United States, the formation of an Asian American identity around common cultural backgrounds and social issues, relations between Asian Americans and multicultural America, and significance of documenting history of groups such as Asian Americans. "},{"prereq":"AACS 200","course_num":"","hours":"3","credits":"3","text":"AIV. 16 Urban Studies (11-16, approved by Academic Senate 5/5/11)\nAACS 220: Asian American Communities: Culture, Power, and Agency. \n3 hr., 3cr. Prereq: AACS 200\nPrereq: AACS 200\nThe shaping of Asian American communities have been by state policies, social constructions such as race and gender, inter-community relations, and by literary and cultural productions. A key component of the course will be analysis of community organizations, their structure and mandate, and the various issues they address such as educational opportunities, health care, citizenship rights. ","title":"and Agency","description":"The shaping of Asian American communities have been by state policies, social constructions such as race and gender, inter-community relations, and by literary and cultural productions. A key component of the course will be analysis of community organizations, their structure and mandate, and the various issues they address such as educational opportunities, health care, citizenship rights. "},{"prereq":"AACS 220.","course_num":"370","hours":"3","credits":"3","text":"AIV. 17 Urban Studies (11-16, approved by Academic Senate 5/5/11)\nAACS 370: Field Work in Asian American Communities-Opportunities for Service Learning and Research.\n3 hr., 3 cr. Prereq: AACS 220.\nPrereq: AACS 220.\nA credit-bearing internship for students interested in pursuing applied knowledge in Asian American community organizations and American agencies serving these populations which is meant as a capstone for the AACS minor. The internships are accompanied by regular meetings with a faculty who will supervise the learning experiences and outcomes of the students. (A waiver to the Internships may be granted to students willing to pursue an independent study research project with a faculty from any department and division of the College. An approval by director will be required for this waiver.)","title":"Field Work in Asian American Communities","description":"A credit-bearing internship for students interested in pursuing applied knowledge in Asian American community organizations and American agencies serving these populations which is meant as a capstone for the AACS minor. The internships are accompanied by regular meetings with a faculty who will supervise the learning experiences and outcomes of the students. (A waiver to the Internships may be granted to students willing to pursue an independent study research project with a faculty from any department and division of the College. An approval by director will be required for this waiver.)"},{"prereq":"(a) SEYS 552—Educational Psychology and SEYS 536—Educational Foundations; or (b) EECE 702—Social Foundations of Education, EECE 704—Major Contemporary Issues in Education and EECE 705—School and Community Relations ","course_num":"550","text":"AIV. 1 Educational and Community Programs ( approved by Academic Senate 5/5/11)\nECPSE 550. Foundations of Special Education \nHours and credits: 3 hr. plus 15 hr. of fieldwork; 3 cr.\nPrerequisites either: (a) SEYS 552—Educational Psychology and SEYS 536—Educational Foundations; or (b) EECE 702—Social Foundations of Education, EECE 704—Major Contemporary Issues in Education and EECE 705—School and Community Relations \nCo requisite A discipline-specific teacher educator course with fieldwork\n1 \nECPSE 550 prepares non-special education teacher education candidates with the knowledge, skills, and dispositions necessary to provide instruction that will promote the participation and progress of students with disabilities in the general education curriculum and prepares candidates with competencies to work collaboratively with colleagues. Teacher education candidates across certification areas and age-ranges are exposed to research-validated professional practice that result in the creation of effective instructional environments for all students, with specific focus on those students who are classified for special education services and supports with mild, moderate, and severe disabilities. The historical and sociological treatment of people with disabilities, special education law, adapting curriculum and instruction, understanding Individualized Education Programs (IEPs), participating in IEP meetings, and advocacy and collaboration are also addressed. Candidates are provided with multiple opportunities to engage in reflective practice regarding the implications of course content to their specific educational disciplines in terms of personalizing instruction and building classroom communities that support the full diversity of learners. Fifteen hours of fieldwork focusing on meeting the needs of students with disabilities within candidates’ certification area or age-range are required. \nCourse Rationale:  \nNew regulations for teacher education programs (effective February 2, 2011) from the New York State Education Department “require that all teacher education programs include three semester hours of study for teachers to develop the skills necessary to provide instruction that will promote the participation and progress of students with disabilities in the general education curriculum.  In addition for traditional programs, 15 of the 100 hours of introductory field experience…must focus on understanding the needs of the students with disabilities.”.” (Frey memo to Deans and Directors of Institution of Higher Education Offering Teacher Education Programs, dated 11/3/2010) ECPSE 550 was specifically developed to ensure that all graduate teacher education programs at Queens College that prepare candidates for initial teacher certification will be in compliance with these new NYSED requirements and also that all teacher education candidates will be exposed to content, pedagogy, and field experiences related to meeting the needs of students with disabilities that are instructionally appropriate and meaningful. ","title":"Foundations of Special Education ","description":"Hours and credits: 3 hr. plus 15 hr. of fieldwork; 3 cr."}]